{"13": {"0": "cast: Ben Affleck as Bruce Wayne / Batman Henry Cavill as Clark Kent / Superman Amy Adams as Lois Lane Jesse Eisenberg as Lex Luthor Diane Lane as Martha Kent. critical_response:  153 minutes of a grown man whacking two dolls together, has the definition of 'movie' changed from 'motion picture story that a human wrote on purpose' to '700 only tangentially related 12-second grey and red vignettes ?  The point of Batman v Superman isn't fun, and it isn't thinking, either. It's obedience. The theology is invoked ... to buttress a spectacle of power. And in that way the film serves as a metaphor for its own aspirations. The corporations that produce movies like this one, and the ambitious hacks who sign up to make them, have no evident motive beyond their own aggrandizement.  better than Man of Steel but below the high bar set by Nolan's Dark Knight  As the film progresses, Lex degenerates into a gibbering mad man, some strange mix of the Riddler and the Joker with a little bit of Mark Zuckerberg added for flair.. director: Zack Snyder. genre: SuperHero. introduction: Batman v Superman: Dawn of Justice is a 2016 American superhero film featuring the DC Comics characters Batman and Superman. Directed by Zack Snyder, it is the second installment in the DC Extended Universe (DCEU), following 2013's Man of Steel. It was written by Chris Terrio and David S. Goyer, and features an ensemble cast that includes Ben Affleck, Henry Cavill, Amy Adams, Jesse Eisenberg, Diane Lane, Laurence Fishburne, Jeremy Irons, Holly Hunter, and Gal Gadot. Batman v Superman: Dawn of Justice is the first live-action film to feature Batman and Superman together, as well as the first live-action cinematic portrayal of Wonder Woman. In the film, criminal mastermind Lex Luthor (Eisenberg) manipulates Batman (Affleck) into a preemptive battle with Superman (Cavill), whom Luthor is obsessed with defeating.. movieName: Batman vs Superman. rating: Rotten Tomatoes: 27% and average: 4.9/10 Metacritic Score: 44/100 CinemaScore: B. year: 2016.", "1": "Eighteen months after the battle between Superman and General Zod in Metropolis, Superman has become a controversial figure. Billionaire Bruce Wayne, who has operated in Gotham City as the vigilante Batman for two decades, sees Superman as an existential threat to humanity. After learning of Batman's form of justice, Clark Kent seeks to expose him via Daily Planet articles. Wayne learns that Russian weapon trafficker Anatoli Knyazev has been contacting LexCorp mogul Lex Luthor. Meanwhile, Luthor unsuccessfully tries to persuade Senator June Finch to allow him to import kryptonite retrieved from the Indian Ocean following Zod's terraforming attempt, claiming he wants to maintain it as a 'deterrent' against future Kryptonian threats. He instead makes alternative plans with Finch's subordinate and gains access to Zod's body and the Kryptonian scout ship. ", "2": "Later, Luthor kidnaps Lois and Martha Kent, Clark's adoptive mother, to bring Superman out of exile. He reveals to him that he manipulated Superman and Batman by fueling their distrust for each other. Luthor demands that Superman kill Batman in exchange for Martha's life. Superman tries to explain the situation to Batman, but instead Batman fights Superman and eventually subdues him. Before Batman can kill him with the spear, Superman urges Batman to 'save Martha', whose name is also shared with Bruce's late mother, confusing him long enough for Lois to arrive and explain what Superman meant. Realizing how far he has fallen and unwilling to let an innocent die, Batman rescues Martha, while Superman confronts Luthor on the scout ship. ", "3": "Luthor is arrested and Batman confronts him in prison, warning Luthor that he will always be watching him. Luthor gloats that Superman's death has made the world vulnerable to powerful alien threats. A memorial is held for Superman in Metropolis. Clark is also declared dead, with various friends and family members including Bruce Wayne and Diana Prince attending for him in Smallville. Martha gives an envelope to Lois, which contains an engagement ring from Clark. After the funeral, Bruce expresses his regrets to Diana about how he failed Superman. He reveals to her that he plans to form a team of metahumans, starting with those from Luthor's files, to help protect the world in Superman's absence. After they leave, the dirt atop Clark's coffin levitates. "}, "24": {"0": "cast: Hugh Jackman as Charlie Kenton Dakota Goyo as Max Kenton Evangeline Lilly as Bailey Tallet Anthony Mackie as Finn Olga Fonda as Farra Lemkova. critical_response: Real Steel is a real movie. It has characters, it matters who they are, it makes sense of its action, it has a compelling plot. Sometimes you go into a movie with low expectations and are pleasantly surprised. makes good use of his specialized skill in blending people and computer-made imaginary things into one lively, emotionally satisfying story Though the premise of fighting robots does seem a plausible and intriguing extension of the contemporary WWE world, Real Steel is hampered by leaden, cliche d moments in which a stubborn boy teaches his childish father a valuable lesson. Rocky with robots? It's not quite in Balboa's weight class, but Real Steel at least has some heft. There's barely a story beat among the beat-downs that you won't expect, and sometimes the saccharine gets in the way of the spectacle, but on the whole this is enjoyable family entertainment.. director: Shawn Levy. genre: Science, Sports. introduction: Real Steel is a 2011 American science fiction sports film starring Hugh Jackman and Dakota Goyo and co-produced and directed by Shawn Levy for DreamWorks Pictures. The film is based on the short story \"Steel\", written by Richard Matheson, which was originally published in the May 1956 edition of The Magazine of Fantasy & Science Fiction, and later adapted into a 1963 Twilight Zone episode. Real Steel was in development for several years before production began on June 24, 2010. Filming took place primarily in the U.S. state of Michigan. Animatronic robots were built for the film, and motion capture technology was used to depict the brawling of computer-generated robots and animatronics.. movieName: Real Steel. rating: Rotten Tomatoes: 59% and average: 5.9/10 Metacritic Score: 56/100 CinemaScore: A. year: 2011.", "1": "In 2020, human boxers are replaced by robots. Charlie Kenton (Hugh Jackman), a former boxer, owns 'Ambush', but loses it in a fight against a bull belonging to promoter and carnival owner Ricky (Kevin Durand), who rigged the fight to mess with Charlie as he sees him as a joke, partially because he beat him up the last time they competed for bailing on the bet. Having made a bet that Ambush would win as a result, Charlie now has a debt to Ricky that he can't pay which he runs out on. ", "2": "At Max's behest, Charlie pits Atom against 'Metro', whom Atom overcomes. Max programs Noisy Boy's vocal-respond controls in Atom, and convinces Charlie to help him with Atom's fighting move memory, resulting in a series of victories and culminating to being offered a fight in World Robot Boxing against national champion 'Twin Cities'. After reaching the arena, the owner of global champion 'Zeus' offers to buy Atom, which Max instantly rejects. Charlie disagrees, but eventually takes Max's side. The fight starts with Atom on the attack, but Twin Cities easily takes the offensive and corners Atom. While their opponent has no blind spot, Charlie notices a hitch whenever Twin Cities throws a right jab. Using this, Charlie is able to get Atom out of the corner and eventually win by knockout. Elated by their success, Max challenges Zeus, publicly, with the audience squarely on their side. After the fight, Ricky and his two henchmen ambush Charlie for bailing earlier and rob them of their winnings, prompting Charlie to return Max to Debra. ", "3": "Zeus starts the fight by knocking Atom down with its first punch, but Atom gets up, and Zeus continues its assault, knocking Atom down multiple times, but each time Atom gets back up, and eventually is able to land its first punch, a right uppercut. Atom survives the first round, stunning the audience. Ricky, who had made a bet with a friend of Charlie's of $100,000 that Atom would not last the round, tries to slip away, but is cornered by the fight's bookmakers. The two opponents go back and forth throughout the fight, Atom landing multiple punches but also getting knocked down many times, getting back up for each of them. Late in the fourth round, Atom's vocal-respond controls are damaged, forcing Charlie to use its 'shadow function' to make it mimic his boxing skills. This, and the fact that Zeus starts running out of power from its constant offense, tip the odds in Atom's favor, forcing Zeus' programmer to manually control it, and Max and Bailey both watch Charlie doing what he was meant to do, and are touched by seeing him literally fighting for his son. Zeus gets a sound beating, once even hitting the ground and barely avoiding losing by knockout, but survives the final round and wins the match by the judges' decision. The technologically superior machine remains undefeated, but with the humiliation of being fought to a near-loss, to which Atom is hailed the 'People's Champion'. "}, "17": {"0": "cast: Jesse Eisenberg as Mark Zuckerberg Andrew Garfield as Eduardo Saverin Justin Timberlake as Sean Parker Armie Hammer as Cameron and Tyler Winklevoss Max Minghella as Divya Narendra. critical_response: David Fincher's film has the rare quality of being not only as smart as its brilliant hero, but in the same way. It is cocksure, impatient, cold, exciting and instinctively perceptive. The Social Network is the movie of the year. But Fincher and Sorkin triumph by taking it further. Lacing their scathing wit with an aching sadness, they define the dark irony of the past decade. The biographical part takes liberties with its subject. Aaron Sorkin based his screenplay on a contentious book, Ben Mezrich's The Accidental Billionaires, so everything that's seen isn't necessarily to be believed.. director: David Fincher. genre: Biographical, drama. introduction: The Social Network is a 2010 American biographical drama film directed by David Fincher and written by Aaron Sorkin. Adapted from Ben Mezrich's 2009 book The Accidental Billionaires: The Founding of Facebook, A Tale of Sex, Money, Genius and Betrayal, the film portrays the founding of social networking website Facebook and the resulting lawsuits. It stars Jesse Eisenberg as founder Mark Zuckerberg, along with Andrew Garfield as Eduardo Saverin, Justin Timberlake as Sean Parker, and Armie Hammer as Cameron and Tyler Winklevoss. Neither Zuckerberg nor any other Facebook staff were involved with the project, although Saverin was a consultant for Mezrich's book.[3] The film was released in the United States by Columbia Pictures on October 1, 2010.. movieName: The Social Network. rating: Rotten Tomatoes: 96% and average: 9/10 Metacritic Score: 95/100 CinemaScore: B+. year: 2010.", "1": "In October 2003, 19-year-old Harvard University student Mark Zuckerberg is dumped by his girlfriend Erica Albright. Returning to his dorm, Zuckerberg writes an insulting entry about Albright on his LiveJournal blog and then creates a campus website called Facemash by hacking into college databases to steal photos of female students, then allowing site visitors to rate their attractiveness. After traffic to the site crashes parts of Harvard's computer network, Zuckerberg is given six months of academic probation. However, Facemash's popularity attracts the attention of Harvard upperclassmen and twins Cameron and Tyler Winklevoss and their business partner Divya Narendra. The trio invites Zuckerberg to work on Harvard Connection, a social network featuring the exclusive nature of Harvard students and aimed at dating. ", "2": "Saverin and Zuckerberg meet fellow student Christy Lee, who asks them to 'Facebook me', a phrase which impresses both of them. As Thefacebook grows in popularity, Zuckerberg extends the network to Yale University, Columbia University and Stanford University. Lee arranges for Saverin and Zuckerberg to meet Napster co-founder Sean Parker, who presents a 'billion dollar' vision for the company that impresses Zuckerberg. He also suggests dropping 'The' from Thefacebook, just calling it Facebook. At Parker's suggestion, the company moves to Palo Alto, with Saverin remaining in New York to work on business development. After Parker promises to expand Facebook to two continents, Zuckerberg invites him to live at the house he is using as company headquarters. ", "3": "Throughout the film, the narrative is intercut with scenes from depositions taken in the Winklevoss twins' and Saverin's respective lawsuits against Zuckerberg and Facebook. The Winklevoss twins claim that Zuckerberg stole their idea, while Saverin claims his shares of Facebook were unfairly diluted when the company was incorporated. At the end, Marylin Delpy, a junior lawyer for the defense, informs Zuckerberg that they will settle with Saverin, since the sordid details of Facebook's founding and Zuckerberg's own callous attitude will make him highly unsympathetic to a jury. After everyone leaves, Zuckerberg is shown sending a friend request to Albright on Facebook and then refreshing the webpage every few seconds as he waits for her response. the world in Superman's absence. After they leave, the dirt atop Clark's coffin levitates. "}, "20": {"0": "cast: Macaulay Culkin as Kevin Joe Pesci as Harry Daniel Stern as Marv John Heard as Peter Roberts Blossom as Marley. critical_response: the film's first half is 'flat and unsurprising as its cute little premise suggests', the second half is praised for its slapstick humor. The conversation between Kevin and Marley, as well as the film's final scenes, is also praised. He compared the elaborate booby-traps in the film to Rube Goldberg machines, writing 'they're the kinds of traps that any 8-year-old could devise, if he had a budget of tens of thousands of dollars and the assistance of a crew of movie special effects people' and criticized the plot as 'so implausible that it makes it hard for [him] to really care about the plight of the kid [Kevin] sadistic festival of adult-bashing'.  [John] Hughes is pulling our strings as though he'd never learn to do anything else. director: Chris Columbus. genre: Comedy. introduction: Home Alone is a 1990 American comedy film written and produced by John Hughes and directed by Chris Columbus. The film stars Macaulay Culkin as Kevin McCallister, a boy who is mistakenly left behind when his family flies to Paris for their Christmas vacation. Kevin initially relishes being home alone, but soon has to contend with two would-be burglars played by Joe Pesci and Daniel Stern. The film also features Catherine O'Hara and John Heard as Kevin's parents.. movieName: Home Alone. rating: Rotten Tomatoes: 62% and average: 5.5/10 Metacritic Score: 63/100 CinemaScore: A. year: 1990.", "1": "The McCallister family is preparing to spend Christmas in Paris, gathering at Peter and Kate's home outside of Chicago on the night before their departure. Peter and Kate's youngest son, eight-year-old Kevin, is being ridiculed by his siblings and cousins. A fight with his older brother, Buzz, results in Kevin getting sent to the third floor of the house for punishment, where he wishes that his family would disappear. During the night, heavy winds cause damage to power lines, which causes a temporary power outage and resets the alarm clocks, causing the entire family to oversleep. In the confusion and rush to get to the airport, Kevin is accidentally left behind. ", "2": "Kate discovers mid-flight that Kevin is missing and, upon arrival in Paris, the family discovers that all flights for the next two days are booked. Peter and the rest of the family go to his brother Rob's apartment in the city while Kate manages to get a flight back to the United States, only to get as far as Scranton, Pennsylvania. She attempts to book a flight to Chicago but again, everything is booked. Unable to accept this, Kate is overheard by Gus Polinski, the lead member of a traveling polka band, who offers to let her travel with them to Chicago on their way to Milwaukee in a moving van, which she graciously accepts. ", "3": "Kevin returns home and rigs the house with numerous booby traps. Harry and Marv break in, spring the traps, and suffer various injuries. While the duo pursues Kevin around the house, he calls the police and flees the house, luring the duo into a neighboring vacant home. Harry and Marv manage to catch him and discuss how they will get their revenge, but Marley sneaks in and knocks them unconscious with his snow shovel before they can do anything to Kevin. The police arrive and arrest Harry and Marv, having identified all the houses they burgled due to the latter's habit of flooding them. On Christmas Day, Kevin is disappointed to find that his family is still gone. He then hears Kate enter the house and call for him; they reconcile and are soon joined by the rest of the McCallisters, who waited in Paris until they could get a direct flight to Chicago. Kevin keeps silent about his encounter with Harry and Marv, although Peter finds Harry's missing gold tooth. Kevin then observes Marley reuniting with his son and his family. Marley notices Kevin and the pair wave to each other before Marley and his family go inside his house. Buzz suddenly calls out, 'Kevin, what did you do to my room?!' at which point Kevin runs off. "}, "23": {"0": "cast: Billy Crystal as Michael \"Mike\" Wazowski Noah Johnston as Young Mike John Goodman as James P. \"Sulley\" Sullivan Steve Buscemi as Randall \"Randy\" Boggs Helen Mirren as Dean Abigail Hardscrabble, the chair of the Scarer program at Monsters University Peter Sohn as Scott \"Squishy\" Squibbles, an Oozma Kappa fraternity member. critical_response: is true to the spirit of [Monsters, Inc.] and matches its tone. But it never seems content to turn over old ground. It has enough of the right stuff to haunt the imagination long after the immediate buzz of its fluffy-furred cuteness has melted away. For a mere prequel, that's a result. is cute, and funny, and the animation, though not exactly inspired, is certainly colorful. This is a safe, predictable, edge-free, nearly bland effort from a studio that rarely hedges its bets.. director: Dan Scanlon. genre: Comedy, Animation. introduction: Monsters University is a 2013 American 3D computer-animated comedy film produced by Pixar Animation Studios for Walt Disney Pictures.[6] It was directed by Dan Scanlon and produced by Kori Rae, with John Lasseter, Pete Docter, Andrew Stanton and Lee Unkrich as executive producers. The music for the film was composed by Randy Newman, marking his seventh collaboration with Pixar. It was the fourteenth feature film produced by Pixar, and is a prequel to 2001's Monsters, Inc., marking the first time Pixar has made a prequel film.[7] Monsters University tells the story of two monsters, Mike and Sulley, and their time studying at college, where they start off as rivals, but slowly become best friends. John Goodman, Billy Crystal, Steve Buscemi, Bob Peterson, and John Ratzenberger reprise their roles as James P. Sullivan, Mike Wazowski, Randall Boggs, Roz, and the Abominable Snowman, respectively. Bonnie Hunt, who played Ms. Flint in the first film, voices Mike's grade school teacher Ms. Karen Graves.. movieName: Monsters University. rating: Rotten Tomatoes: 79% and average: 6.8/10 Metacritic Score: 65/100 CinemaScore: A. year: 2013.", "1": "Michael 'Mike' Wazowski, a 7-year-old monster, aspires to become a scarer   a monster who enters the human world at night to scare children and harvest their screams for energy   when he grows up after visiting Monsters Inc., Monstropolis' most profitable scaring company, on a school field trip. Eleven years later, Mike is a first-year scare major at Monsters University, where he meets fellow monster, James P. 'Sulley' Sullivan. Mike studies hard, while the privileged Sulley, coming from a family of talented scarers, relies only on his natural ability and begins to falter. As the semester progresses, Mike and Sulley attempt to join a fraternity, but only Sulley is accepted into Roar Omega Roar, the strongest fraternity on campus. At the semester's final exam, a fight between the two causes them to accidentally break Dean Abigail Hardscrabble's cherished Scream Can. Hardscrabble fails both of them immediately, stating that Sulley does not study enough, and Mike is not scary enough. ", "2": "Wanting to prove himself, Mike enters the university's 'Scare Games', and makes a wager with Hardscrabble to reinstate him and his team to the scare program if they win, but Mike must leave the university if they lose. He joins a group of misfits named Oozma Kappa, the weakest fraternity on campus, but they are denied entry to the Games for being one team member short. Sulley subsequently joins them, seeing the competition as his ticket back into the scare program. Oozma Kappa finish last in the first challenge, but are saved from elimination after another team is disqualified for cheating. Oozma Kappa improve gradually due to Mike's training and intricate knowledge of scaring, and they advance through each following challenge, finishing just behind Roar Omega Roar. In the final round, they defeat Roar Omega Roar with a decisive final scare by Mike in the simulation bedroom. However, Mike soon discovers that he only won because Sulley tampered with the machine's difficulty to the easiest setting. ", "3": "Mike and Sulley are led away by the CDA, and are expelled from the university as a result of their actions, but the other members of Oozma Kappa are accepted into the scare program the next semester, as Hardscrabble was impressed by their performances in the Games. As Mike leaves on the bus, Sulley runs after him to raise his spirits. Hardscrabble then appears and wishes the two luck, claiming they were the first students to have surprised her. The two take jobs in the mail room of Monsters, Inc., eventually working their way up to join the scarer team. "}, "19": {"0": "cast: Leonardo DiCaprio as Frank Abagnale, Jr. Tom Hanks as Carl Hanratty Christopher Walken as Frank Abagnale, Sr. Nathalie Baye as Paula Abagnale. Amy Adams as Brenda Strong. critical_response:  This is not a major Spielberg film, although it is an effortlessly watchable one  the range and ease and cleverness that Martin Scorsese so underutilized in Gangs of New York  Catch Me if You Can never takes itself or its subjects too seriously, and contains more genuinely funny material than about 90% of the so-called 'comedies' found in multiplexes these days  bogged down over 140 minutes. A film that took off like a hare on speed ends like a winded tortoise.. director: Steven Spielberg. genre: biographical, crime. introduction: Catch Me If You Can is a 2002 American biographical crime film directed and co-produced by Steven Spielberg from a screenplay by Jeff Nathanson. The film is based on the life of Frank Abagnale, who, before his 19th birthday, successfully performed cons worth millions of dollars by posing as a Pan American World Airways pilot, a Georgia doctor and a Louisiana parish prosecutor. His primary crime was check fraud; he became so experienced that the FBI eventually turned to him for help in catching other checking forgers. The film stars Leonardo DiCaprio and Tom Hanks, with Christopher Walken, Martin Sheen, and Nathalie Baye in supporting roles.. movieName: Catch me if you can. rating: Rotten Tomatoes: 96% and average: 7.9/10 Metacritic Score: 76/100 CinemaScore: A-. year: 2002.", "1": "In 1963, teenaged Frank Abagnale lives in New Rochelle, New York with his father Frank Abagnale, Sr., and French mother Paula. When Frank Sr. is denied a business loan at Chase Manhattan Bank due to unknown difficulties with the IRS, the family is forced to move from their large home to a small apartment. Paula carries on an affair with Jack, a friend of her husband. Meanwhile, Frank poses as a substitute teacher in his French class. Frank's parents file for divorce, and Frank runs away. When he runs out of money, he begins relying on confidence scams to get by. Soon, Frank's cons increase and he even impersonates an airline pilot. He forges Pan Am payroll checks and succeeds in stealing over $2.8 million. ", "2": "The scene then flashes forward to a plane returning Frank home from prison, where Carl informs him that his father has died. Grief-stricken, Frank escapes from the plane and goes back to his old house, where he finds his mother with the man she left his father for, as well as a girl who Frank realizes is his half-sister. Frank gives himself up and is sentenced to 12 years in prison, getting visits from time to time from Carl. When Frank points out how one of the checks Carl is carrying as evidence is fake, Carl convinces the FBI to offer Frank a deal by which he can live out the remainder of his sentence working for the bank fraud department of the FBI, which Frank accepts. While working at the FBI, Frank misses the thrill of the chase and even attempts to fly as an airline pilot again. He is cornered by Carl, who insists that Frank will return to the FBI job since no one is chasing him. On the following Monday, Carl is nervous that Frank has not yet arrived at work. However, Frank eventually arrives and they discuss their next case. ", "3": "The ending credits reveal that Frank has been happily married for 26 years, has three sons, lives in the Midwest, is still good friends with Carl, has caught some of the world's most elusive money forgers, and earns millions of dollars each year because of his work creating unforgeable checks. "}, "10": {"0": "cast: Jay Baruchel as Hiccup Horrendous Haddock III: companion of Toothless, a Night Fury. Gerard Butler as Stoick the Vast, the chieftain of the Viking tribe and Hiccup's father. Craig Ferguson as Gobber the Belch: blacksmith, a close friend of Stoick's, and training master of the young warriors. America Ferrera as Astrid Hofferson, Hiccup's fellow student.. critical_response: It devotes a great deal of time to aerial battles between tamed dragons and evil ones, and not much to character or story development. But it's bright, good-looking, and has high energy It's a thrilling action-adventure saga with exhilarating 3-D animation, a clever comedy with witty dialogue, a coming-of-age tale with surprising depth and a sweetly poignant tale of friendship between man and animal. more coming-of-age dramedy or 'everything about your world view is wrong' message movie than it is a comedy, and that seems like a waste of a funny book, some very funny actors and some darned witty animation. Technically proficient and featuring a witty, intelligent, surprisingly insightful script, How to Train Your Dragon comes close to the level of Pixar's recent output while easily exceeding the juvenilia DreamWorks has released in the last nine years. How to Train Your Dragon rouses you in conventional ways, but it's also the rare animated film that uses 3-D for its breathtaking spatial and emotional possibilities.. director: Chris Sanders, Dean DeBlois. genre: animation, fantasy. introduction: How to Train Your Dragon is a 2010 American 3D computer-animated action-fantasy film produced by DreamWorks Animation and distributed by Paramount Pictures.1 Loosely based on the British book series of the same name by Cressida Cowell, the film was directed by Chris Sanders and Dean DeBlois, the duo who directed Disney's Lilo & Stitch. It stars the voices of Jay Baruchel, Gerard Butler, Craig Ferguson, America Ferrera, Jonah Hill, T.J. Miller, Kristen Wiig, and Christopher Mintz-Plasse.. movieName: How to Train Your Dragon. rating: Rotten Tomatoes: 98% and average: 7.9/10 Metacritic Score: 74/100 CinemaScore: A. year: 2010.", "1": "The Isle of Berk is a remote Viking village, from which dragons periodically steal livestock. Hiccup, the awkward fifteen-year-old son of the village chieftain, Stoick the Vast, is too small to fight the dragons and instead fashions mechanical devices under his apprenticeship with Gobber the blacksmith, though his inventions often backfire. During one attack, Hiccup believes he has shot down a Night Fury, an extremely rare and dangerous dragon. Hiccup later finds it in the forest trapped in his bolas, but finds that he cannot bring himself to kill the dragon and instead sets it free. ", "2": "Stoick assembles a fleet to find the dragons' nest, leaving Hiccup in a dragon-fighting class taught by Gobber. Hiccup returns to the forest to find the Night Fury still there, and realizes it is unable to fly properly because of its crippled caudal fin. Hiccup gradually tames the dragon and gives it the name 'Toothless', for its retractable teeth. Hiccup makes a harness and prosthetic fin that allows him to guide the dragon in free flight. By studying Toothless's behavior, Hiccup becomes proficient in subduing the captive dragons during training. Stoick's fleet arrives home unsuccessful, but he is cheered by Hiccup's unexpected success. ", "3": "Back at the village, Hiccup subdues a captive dragon in his final training test in front of his father instead of killing it, but Stoick inadvertently angers the dragon into attacking. Toothless attempts to protect Hiccup in the ensuing panic but is instead captured by the Vikings. Hiccup accidentally reveals to Stoick that Toothless is capable of locating the dragons' nest. Stoick disowns his son and sets off for the nest with Toothless chained to the lead ship as a guide. The Vikings expel most of the dragons but are overwhelmed by the Red Death until Hiccup, Astrid and their fellow pupils fly in riding the training dragons from the academy and provide cover fire. Hiccup almost drowns trying to break Toothless free from a sinking ship but Stoick saves them both and then reconciles with his son. Toothless and Hiccup destroy the Red Death but Hiccup is injured in the fight. Hiccup regains consciousness on Berk where his lower left leg has been replaced by a prosthesis, and the Vikings and the dragons now live in harmony. "}, "25": {"0": "cast: Leonardo DiCaprio as Jay Gatsby, a famous billionaire who hosts wild parties at his house in the hope that Daisy will show up. Tobey Maguire as Nick Carraway, a would-be writer who is also Gatsby s neighbor and friend. He is the narrator of this movie. Carey Mulligan as Daisy Buchanan, Gatsby s former lover and Tom s wife. Emily Foreman as Pamela \"Pammy\" Buchanan Joel Edgerton as Tom Buchanan, Upper class socialite who hates Gatsby because of his new money status and relationship with Daisy. critical_response: intractably wrong with the film is that there's no reality to heighten; it's a spectacle in search of a soul. less a conventional movie adaptation than a splashy, trashy opera, a wayward, lavishly theatrical celebration of the emotional and material extravagance that Fitzgerald surveyed with fascinated ambivalence the best way to enjoy the film is to put aside whatever literary agenda you are tempted to bring with you.  the stand-out actor is Joel Edgerton as Tom Buchanan doing an excellent job of showing the character s gruffness, despite the one-dimensionality given to him. director: Baz Luhrmann. genre: Romantic, Drama. introduction: The Great Gatsby is a 2013 period romantic drama film based on F. Scott Fitzgerald's 1925 novel of the same name. The film was co-written and directed by Baz Luhrmann and stars Leonardo DiCaprio as the eponymous Jay Gatsby, with Tobey Maguire, Carey Mulligan, Joel Edgerton, Isla Fisher and Elizabeth Debicki.[5] Production began in 2011 and took place in Australia, with a $190 million budget. The film follows the life and times of millionaire Jay Gatsby and his neighbor Nick Carraway (Tobey Maguire), who recounts his encounter with Gatsby at the height of the Roaring Twenties in New York state.. movieName: The Great Gatsby. rating: Rotten Tomatoes: 48% and average: 5.8/10 Metacritic Score: 55/100 CinemaScore: B. year: 2013.", "1": "In 1931, Nick Carraway, a World War I veteran, is receiving treatment for alcoholism at a psychiatric hospital. He talks about Jay Gatsby, the most hopeful man he had ever met. Nick's doctor suggests that he writes his thoughts down, since writing is Nick's passion. In the summer of 1922, Nick moves from the Midwest to New York after abandoning writing. He rents a small house in the North Shore village of West Egg, next to the mansion of Gatsby, a mysterious business magnate who often holds extravagant parties. One day, while Nick has dinner with his cousin, Daisy Buchanan, and her husband, Tom, he is introduced to Jordan Baker by Daisy, who hopes to make a match between them. When Nick returns home, he sees Gatsby standing on the dock, reaching towards the green light coming from the Buchanan dock. ", "2": "At the Plaza, Gatsby tells Tom of his affair with Daisy. Tom accuses Gatsby of having never attended Oxford and having made his fortune through bootlegging with mobsters. Daisy says she loves Gatsby but cannot bring herself to say she never loved Tom. Eventually, both Gatsby and Daisy leave. After fighting with George over her infidelity, Myrtle runs into the street and is fatally struck by Gatsby's car after mistaking it for Tom's. After learning about Myrtle's death, Tom tells George that the car belongs to Gatsby and that he suspects Gatsby was Myrtle's lover. Nick deduces Daisy was the driver, though Gatsby intends to take the blame. Nick overhears Daisy accepting Tom's promise to take care of everything, but he does not tell Gatsby. Gatsby admits to Nick that he was born penniless; his real name is James Gatz, and he had asked Daisy to wait for him until he had made something of himself. ", "3": "The next day, Gatsby hears the phone ringing and thinks it's Daisy. Before he can answer it, he is shot and killed by George, who then commits suicide. Nick is the only person other than reporters to attend Gatsby's funeral, as Daisy and Tom are leaving New York. The media paints Gatsby as Myrtle's lover and killer. Disgusted with both the city and its inhabitants, Nick leaves after taking a final walk through Gatsby's deserted mansion and reflecting on Gatsby's ability to hope. In the sanatorium, Nick finishes typing his memoir, titling it The Great Gatsby. "}, "6": {"0": "cast: Keanu Reeves as Jonathan \"John\" Wick, an ex-hitman who returns to the criminal underworld following the death of his wife and a run-in with a Russian Crime Syndicate. Michael Nyqvist as Viggo, the head of the Tarasov family and an enterprising businessman with questionable roots. Alfie Allen as Iosef, the arrogant, entitled and foolish son of Viggo. Adrianne Palicki as Ms. Perkins, a distinguished female contract killer in the underworld of assassins, and a former acquaintance of John.. critical_response: John Wick is the kind of fired-up, ferocious B-movie fun some of us can't get enough of Action movies are about movement, and John Wick pursues that goal with remorseless verve. After a marked absence from the genre, Reeves resoundingly returns with an effortless, kinetic style that positions the film extremely well for any potential follow-ups. Harboring few ambitions beyond knock-your-socks-off action sequences, this crafty revenge thriller delivers with so much style   and even some wit   that the lack of substance takes longer than it should to become problematic. Reeves's semi-deliberate zonked deadpan style only really works in juxtaposition with funny dialogue   and this is a pretty humourless and violent film, which grinds on and on with more and more gleaming black SUVs getting trashed.. director: Chad Stahelski. genre: Action. introduction: John Wick is a 2014 American neo-noir action thriller film directed by Chad Stahelski and David Leitch. It stars Keanu Reeves, Michael Nyqvist, Alfie Allen, Adrianne Palicki, Bridget Moynahan, Dean Winters, Ian McShane, John Leguizamo and Willem Dafoe. The first installment in the John Wick film series, the story focuses on John Wick (Reeves), a retired hitman seeking vengeance for the theft of his vintage car and the killing of his puppy, a gift from his recently deceased wife. Stahelski and Leitch directed the film together, though only Stahelski was credited.. movieName: John Wick. rating: Rotten Tomatoes: 86% and average: 6.9/10 Metacritic Score: 68/100 CinemaScore: B. year: 2014.", "1": "Iosef takes the Mustang to a chop shop run by Aurelio to have the VIN changed. Aurelio recognizes the car and, upon learning that Iosef stole it from John, punches him before throwing him out of his shop. John visits Aurelio, who tells him Iosef is the son of Viggo Tarasov, the head of the Russian crime syndicate in New York City. Viggo, informed by Aurelio of Iosef's actions, beats and berates Iosef, explaining to him that John Wick was his best assassin, nicknamed 'Baba Yaga.' When John wanted to retire and marry Helen, Viggo gave him an 'impossible task', implied to involve multiple assassinations. John succeeded, establishing the Tarasov syndicate. ", "2": "John learns from Winston, the Continental's owner, that Viggo has Iosef protected at his nightclub, the Red Circle. John enters the Red Circle and kills his way to Iosef, but Viggo's henchman Kirill waylays John, allowing Iosef to escape. John retreats to the Continental to tend his injuries. Ms. Perkins, an assassin and former acquaintance, sneaks into John's room to kill him, but Marcus alerts John, allowing him to subdue Perkins. He forces Perkins to reveal the location of Viggo's front, knocks her unconscious and leaves her with fellow assassin Harry to await punishment. However, Perkins frees herself and kills Harry.  John travels to the Little Russia church which serves as Viggo's front and destroys Viggo's cache of money and blackmail material. When Viggo and his team arrive, John ambushes them, but he is subdued and captured. Viggo taunts John for thinking he could leave his old life behind. Before John can be killed, Marcus intervenes again, allowing John to free himself, kill Kirill, and accost Viggo. Under John's gunpoint, Viggo reveals Iosef's location to him. John then travels to Iosef's 'safe house' and kills him. ", "3": "Perkins sees that John and Marcus have been in contact and tells Viggo, who has Marcus tortured before executing him in his home. Viggo calls John to report this, planning to have Perkins ambush him. Perkins, however, is called to a meeting with Winston, who has her executed for breaking the Continental's rules.  Winston calls John to inform him that Viggo is planning to escape by helicopter, and John races to the harbor, killing Viggo's remaining henchmen before engaging Viggo in a fistfight on the dock. Viggo pulls a knife and John allows himself to be stabbed, surprising Viggo. John then disarms and fatally wounds Viggo. Wounded himself, John stops at a waterfront animal clinic to treat his wound and takes with him a pit bull puppy which was scheduled to be euthanized. John and the dog walk home on the boardwalk where he had his last date with Helen. "}, "28": {"0": "cast: Leonardo DiCaprio as Jordan Belfort Jonah Hill as Donnie Azoff Margot Robbie as Naomi Lapaglia Kyle Chandler as Patrick Denham Rob Reiner as Max Belfort. critical_response: Epic in size, claustrophobically narrow in scope. the story 'wants us to be interested in characters who are dull people to start with, made duller by their delusions of being interesting because they are high. an irresponsible glorification rather than a satirical takedown.. director: Martin Scorsese. genre: black comedy. introduction: The Wolf of Wall Street is a 2013 American black comedy[3] directed by Martin Scorsese and written by Terence Winter, based on the memoir of the same name by Jordan Belfort. It recounts Belfort's perspective on his career as a stockbroker in New York City and how his firm Stratton Oakmont engaged in rampant corruption and fraud on Wall Street that ultimately led to his downfall. Leonardo DiCaprio (who was also a producer) stars as Belfort, with Jonah Hill as his business partner and friend Donnie Azoff, Margot Robbie as his wife Naomi Lapaglia and Kyle Chandler as Patrick Denham, the FBI agent who tries to bring him down. Matthew McConaughey, Rob Reiner, Jon Favreau, Joanna Lumley and Jean Dujardin also star. . movieName: The Wolf of Wall Street. rating: Rotten Tomatoes: 78% and average: 7.8/10 Metacritic Score: 75/100 CinemaScore: C. year: 2013.", "1": "In 1987, Jordan Belfort procures a job as a Wall Street stockbroker for L.F. Rothschild, employed under Mark Hanna, who quickly entices him with the sex and drugs fueled stockbroker culture and teaches him that a stockbroker's only job is to make money for himself. Jordan soon finds his career terminated following Black Monday and takes a job at a boiler room brokerage firm on Long Island that specializes in penny stocks. Thanks to his aggressive pitching style and the high commissions, Jordan makes a small fortune. ", "2": "Jordan befriends his neighbor, Donnie Azoff, and the two found their own company. They recruit several of Jordan's friends, whom Jordan trains in the art of the 'hard sell'. The basic method of the firm is a pump and dump scam. To cloak this, Jordan gives the firm the respectable-sounding name of Stratton Oakmont. After an expose  in Forbes, hundreds of ambitious young financiers flock to his company. Jordan becomes immensely successful and slides into a decadent lifestyle full of prostitutes and drugs. He has an affair with a woman named Naomi Lapaglia. When his wife finds out, they divorce, and he marries Naomi. Meanwhile, the SEC and the FBI begin investigating Stratton Oakmont. Jordan illegally makes $22 million in three hours upon securing the IPO of Steve Madden. This brings him and his firm to the attention of the FBI. To hide his money, Jordan opens a Swiss bank account with corrupt banker Jean-Jacques Saurel in the name of Naomi's Aunt Emma, who is a British national and thus outside the reach of American authorities. He uses the wife and in-laws of his friend Brad Bodnick, who have European passports, to smuggle the cash into Switzerland. ", "3": "Two years later, the FBI arrests Jordan because Saurel, arrested in Florida on an unrelated charge, has also informed on Jordan. Since the evidence against him is overwhelming, Jordan agrees to gather evidence on his colleagues in exchange for leniency. Fed up with Jordan's lifestyle, Naomi tells Jordan she is divorcing him and wants full custody of their children. Jordan loses his mind and tries to run off with his daughter Skylar in his car, but he ends up crashing in the driveway. The next morning, Jordan wears a wire to work but slips a note to Donnie warning him. Donnie keeps the note and rats out on Jordan to the FBI. Jordan is arrested for breaching his co-operation deal. The FBI raids and shuts down Stratton Oakmont. Despite this one breach, Jordan receives a reduced sentence for his testimony and serves three years in a minimum security prison. After his release, Jordan makes a living hosting seminars on sales technique. "}, "2": {"0": "cast: Roy Scheider as Chief Martin Brody Robert Shaw as Quint Richard Dreyfuss as Matt Hooper Lorraine Gary as Ellen Brody. critical_response: a sensationally effective action picture, a scary thriller that works all the better because it's populated with characters that have been developed into human beings the most cheerfully perverse scare movie ever made ... [with] more zest than an early  picture, a lot more electricity, [and] it's funny in a Woody Allen sort of way Spielberg is blessed with a talent that is absurdly absent from most American filmmakers these days: this man actually knows how to tell a story on screen. ... It speaks well of this director's gifts that some of the most frightening sequences in Jaws are those where we don't even see the shark. It's a measure of how the film operates that not once do we feel particular sympathy for any of the shark's victims. ... In the best films, characters are revealed in terms of the action. In movies like Jaws, characters are simply functions of the action ... like stage hands who move props around and deliver information when it's necessary Jaws is too gruesome for children, and likely to turn the stomach of the impressionable at any age. ... It is a coarse-grained and exploitative work which depends on excess for its impact. Ashore it is a bore, awkwardly staged and lumpily written. scare machine that works with computer-like precision. ... You feel like a rat, being given shock therapy. director: Steven Spielberg. genre: thriller. introduction: Jaws is a 1975 American  directed by  and based on 's 1974 . In the story, a giant   attacks beachgoers on Amity Island, a fictional summer , prompting the local police chief to hunt it with the help of a  and a professional shark hunter. The film stars  as police chief ,  as shark hunter Quint,  as oceanographer Matt Hooper,  as Larry Vaughn, the mayor of Amity Island, and  as Brody's wife, Ellen.. movieName: Jaws. rating: Rotten Tomatoes: 97% with an average: 9.2/10  Metacritics: 87/100 IMDB: 8.0/10. year: 1975.", "1": "A beach party takes place at dusk on Amity Island, where a woman named Chrissie Watkins goes skinny dipping in the ocean. While , she is violently pulled under. The next day, her partial remains are found on shore. The medical examiner ruling the death a shark attack leads to Police Chief Martin Brody closing the beaches. Mayor Larry Vaughn overrules him, fearing it will ruin the town's summer economy. The coroner now concurs with the mayor's theory that Watkins was killed in a boating accident. Brody reluctantly accepts their conclusion until another fatal shark attack occurs shortly after. A bounty is then placed on the shark, resulting in an amateur shark-hunting frenzy. Local professional shark hunter Quint offers his services for $10,000. Meanwhile, consulting oceanographer Matt Hooper examines Watkins' remains and confirms her death was from a shark attack. ", "2": "When local fishermen catch a large , the mayor proclaims the beaches safe. Hooper disputes it being the same predator, confirming this after no human remains are found inside it. Hooper and Brody find a half-sunken vessel while searching the night waters in Hooper's boat. Underwater, Hooper retrieves a sizable 's tooth embedded in the submerged . He drops it after finding a partial corpse. Vaughn discounts Brody and Hooper's claims that a huge great white shark is responsible and refuses to close the beaches, allowing only added safety precautions. On the Fourth of July weekend, tourists fill the beaches. Following a juvenile prank, the real shark enters a nearby , killing a boater and causing Brody's son, Michael, to go into shock. Brody finally convinces a devastated Vaughn to hire Quint. ", "3": "Quint, Brody, and Hooper set out on Quint's boat, the Orca, to hunt the shark. While Brody lays down a  line, Quint waits for an opportunity to hook the shark. Without warning, it appears behind the boat. Quint examines the shark and harpoons a barrel into it, but it drags the barrel underwater and disappears. With the Orca slowly sinking, the trio attempt a riskier approach. Hooper puts on  and enters the water in a , intending to lethally inject the shark with  using a hypodermic spear. The shark demolishes the cage before Hooper can inject it, but he manages to escape to the seabed. The shark then attacks the boat directly and devours Quint. Trapped on the sinking vessel, Brody stuffs a pressurized scuba tank into the shark's mouth, and, climbing the mast, shoots the tank with Quint's rifle, destroying it. The resulting explosion kills the shark. Hooper resurfaces, and he and Brody paddle to Amity Island clinging to boat wreckage. "}, "5": {"0": "cast: Leonardo DiCaprio as Dom Cobb, a professional thief who specializes in conning secrets from his victims by infiltrating their dreams. Joseph Gordon-Levitt as Arthur, Cobb's partner who manages and researches the missions. Ellen Page as Ariadne, a graduate student of architecture who is recruited to construct the various dreamscapes, which are described as mazes. Tom Hardy as Eames, a sharp-tongued associate of Cobb.. critical_response: wildly ingenious chess game,' 'the result is a knockout. DiCaprio, who has never been better as the tortured hero, draws you in with a love story that will appeal even to non-sci-fi fans. I found myself wishing Inception were weirder, further out ... the film is Nolan's labyrinth all the way, and it's gratifying to experience a summer movie with large visual ambitions and with nothing more or less on its mind than (as Shakespeare said) a dream that hath no bottom. have no idea what so many people are raving about. It's as if someone went into their heads while they were sleeping and planted the idea that Inception is a visionary masterpiece and hold on ... Whoa! I think I get it. The movie is a metaphor for the power of delusional hype a metaphor for itself.. director: Christopher Nolan. genre: scientific. introduction: Dominick \"Dom\" Cobb and Arthur are \"extractors\", who perform corporate espionage using an experimental military technology to infiltrate the subconscious of their targets and extract valuable information through a shared dream world. Their latest target, Japanese businessman Saito, reveals that he arranged their mission himself to test Cobb for a seemingly impossible job: planting an idea in a person's subconscious, or \"inception\". To break up the energy conglomerate of ailing competitor Maurice Fischer, Saito wants Cobb to convince Fischer's son and heir, Robert, to dissolve his father's company.. movieName: The inception. rating: Rotten Tomatoes: 86% and average: 8.1/10 IMDB: 8.8/10. year: 2009.", "1": "When the elder Fischer dies in Sydney, Robert Fischer accompanies the body on a ten-hour flight back to Los Angeles, which the team (including Saito, who wants to verify their success) uses as an opportunity to sedate and take Fischer into a shared dream. At each dream level, the person generating the dream stays behind to set up a 'kick' that will be used to awaken the other sleeping team members from the deeper dream level; to be successful, these kicks must occur simultaneously at each dream level, a fact complicated due to the nature of time which flows much faster in each successive level. The first level is Yusuf's dream of a rainy Los Angeles. The team abducts Fischer, but they are attacked by armed projections from Fischer's subconscious, which has been specifically trained to defend him against such intruders. The team takes Fischer and a wounded Saito to a warehouse, where Cobb reveals that while dying in the dream would normally wake Saito up, the powerful sedatives needed to stabilize the multi-level dream will instead send a dying dreamer into 'limbo', a world of infinite subconscious from which escape is extremely difficult, if not almost impossible, and a dreamer risks forgetting they are in a dream. Despite these setbacks, the team continues with the mission. ", "2": "Cobb reveals to Ariadne that he and Mal went to Limbo while experimenting with the dream-sharing technology. Sedated for a few hours of real time, they spent fifty years in a dream constructing a world from their shared memories. When Mal refused to return to reality, Cobb used a rudimentary form of inception by reactivating her totem (an object dreamers use to distinguish dreams from reality) and reminding her subconscious that their world was not real. However, when she woke up, Mal still believed that she was dreaming. In an attempt to 'wake up' for real, Mal committed suicide and framed Cobb for her death to force him to do the same. Facing a murder charge, Cobb fled the U.S., leaving his children in the care of Professor Miles. ", "3": "Through his confession, Cobb makes peace with his guilt over Mal's death. Ariadne kills Mal's projection and wakes Fischer up with a kick. Revived at the mountain hospital, Fischer enters a safe room to discover and accept the planted idea: a projection of his dying father telling him to be his own man. While Cobb remains in Limbo to search for Saito, the other team members ride the synchronized kicks back to reality. Cobb eventually finds an aged Saito in Limbo and reminds him of their agreement. The dreamers all awake on the plane and Saito makes a phone call. Upon arrival at Los Angeles Airport, Cobb passes the U.S. immigration checkpoint and Professor Miles accompanies him to his home. Using his totem a spinning top that spins indefinitely in a dream world but falls over in reality Cobb conducts a test to prove that he is indeed in the real world, but he ignores its result and instead joins his children in the garden. "}, "14": {"0": "cast: Christian Bale as Bruce Wayne / Batman Michael Caine as Alfred Pennyworth Liam Neeson as Henri Ducard / Ra's al Ghul Katie Holmes as Rachel Dawes Gary Oldman as James Gordon. critical_response: being both comic-book archetypes and real people comfortably mix the tormented drama and revenge motifs with light hearted gags and comic book allusions,'s who sign up to make them, have no evident motive beyond their own aggrandizement. hype about exploring Batman's damaged psyche both the menace and the wit he showed in his brilliant turn in American Psycho. director: Christopher Nolan. genre: SuperHero. introduction: Batman Begins is a 2005 superhero film based on the DC Comics character Batman, directed by Christopher Nolan and written by Nolan and David S. Goyer. It stars Christian Bale, Michael Caine, Liam Neeson, Katie Holmes, Gary Oldman, Cillian Murphy, Tom Wilkinson, Rutger Hauer, Ken Watanabe, and Morgan Freeman. The film reboots the Batman film series, telling the origin story of Bruce Wayne from the death of his parents to his journey to become Batman and his fight to stop Ra's al Ghul and the Scarecrow from plunging Gotham City into chaos.. movieName: Batman Begins. rating: Rotten Tomatoes: 84% and average: 7.7/10 Metacritic Score: 70/100 CinemaScore: A. year: 2005.", "1": "As a child, Bruce Wayne falls down into a dry well and is attacked by a swarm of bats, subsequently developing a phobia of the creatures. While watching an opera with his parents, Thomas and Martha, Bruce becomes frightened by performers masquerading as bats and asks to leave. Outside, mugger Joe Chill murders Bruce's parents in front of him. Orphaned, Bruce is raised by the family butler, Alfred Pennyworth. ", "2": "Fourteen years later, Chill is freed in exchange for testifying against Gotham City mafia boss Carmine Falcone. Bruce intends to murder Chill, but one of Falcone's assassins does so first. Bruce's childhood friend, assistant district attorney Rachel Dawes, berates him for attempting to undermine the justice system, saying that his father would be ashamed. Bruce confronts Falcone, who tells him that real power comes from being feared. Bruce decides to travel the world and learn how to confront injustice. While serving a prison sentence for theft in Bhutan, he meets Henri Ducard, who trains him as a member of the League of Shadows, led by Ra's al Ghul. After completing his training and purging his fears, Bruce learns that the League intends to destroy Gotham, believing it to be corrupt, decadent, hypocritical and beyond saving. Bruce rejects the League's cause and burns down their temple during his escape. Ra's is killed by falling debris, while Bruce saves the unconscious Ducard. ", "3": "Batman intercepts a drug shipment, provides Rachel with evidence against Falcone, and enlists Sergeant James Gordon, one of the few honest cops left in Gotham, to arrest him. In prison, Falcone meets with Dr. Jonathan Crane, a corrupt psychiatrist whom he has helped smuggle drugs into Gotham, and threatens to reveal his complicity if he does not declare him mentally unfit for trial. Crane puts on a scarecrow mask and sprays Falcone with a fear-inducing hallucinogen that drives him insane (which causes Falcone to constantly mouth the word 'Scarecrow'), and has him transferred to Arkham Asylum. While investigating 'the Scarecrow', Batman is exposed to the hallucinogen and left incapacitated. He is saved by Alfred and given an antidote developed by Fox. When Rachel accuses Crane of corruption, Crane reveals that he has been pouring his fear-inducing drug into Gotham's water supply. He drugs Rachel with it, but Batman saves her and subdues Crane, who claims to work for Ra's al Ghul. Batman evades the police to get Rachel to safety, administers the antidote, and gives her a vial of it for Gordon and another for mass production. Ducard reappears at Bruce's birthday party and reveals himself to be the true Ra's al Ghul. Having stolen a powerful microwave emitter from Wayne Enterprises, he plans to vaporize Gotham's water supply, rendering Crane's drug airborne and causing mass hysteria that will destroy the city. He sets Wayne Manor aflame and leaves Bruce to die, but Alfred rescues him. "}, "0": {"0": "cast: Kristen Bell as Anna, the 18-year-old Princess of Arendelle and Elsa's younger sister, Livvy Stubenrauch as 5-year-old Anna, Katie Lopez as 5-year-old Anna (singing), Agatha Lee Monn as 9-year-old Anna Idina Menzel as Elsa, the 21-year-old Snow Queen of Arendelle and Anna's elder sister, Eva Bella as 8-year-old Elsa, Spencer Lacey Ganus as 12-year-old Elsa Jonathan Groff as Kristoff, an iceman who is accompanied by a reindeer named Sven, Tyree Brown as 8-year-old Kristoff. critical_response: the best animated musical to come out of Disney since the tragic death of lyricist Howard Ashman, whose work on The Little Mermaid and Beauty and the Beast helped build the studio's modern animated division into what it is today. while it lags the tiniest bit on its way to the conclusion, the script... really delivers; it offers characters to care about, along with some nifty twists and surprises along the way. You can practically see the Broadway musical Frozen is destined to become while watching Disney's 3D animated princess tale. a great big snowy pleasure with an emotionally gripping core, brilliant Broadway-style songs and a crafty plot. Its first and third acts are better than the jokey middle, but this is the rare example of a Walt Disney Animation Studios effort that reaches as deep as a Pixar film. Frozen is both a declaration of Disney's renewed cultural relevance and a reaffirmation of Disney coming to terms with its own legacy and its own identity. It's also a just plain terrific bit of family entertainment. . director: Chris Buck, Jennifer Lee. genre: Comedy, Adventure, Animation. introduction: Frozen is a 2013 American 3D computer-animated musical fantasy film produced by Walt Disney Animation Studios and released by Walt Disney Pictures. It is the 53rd Disney animated feature film. Inspired by Hans Christian Andersen's fairy tale \"The Snow Queen\", the film tells the story of a fearless princess who sets off on a journey alongside a rugged iceman, his loyal pet reindeer, and a nai ve snowman to find her estranged sister, whose icy powers have inadvertently trapped the kingdom in eternal winter.. movieName: Frozen. rating: Rotten Tomatoes: 89%  Metacritics: 74/100 CinemaScore: A+. year: 2013.", "1": "Princess Elsa of Arendelle possesses cryokinetic magic, often using it to play with her younger sister, Anna. After Elsa accidentally injures Anna with her magic, their parents, the King and Queen, rush both siblings to a colony of trolls led by Grand Pabbie. He heals Anna, but alters her memories to remove traces of Elsa s magic, warning Elsa that she must learn to control her powers. The King and Queen isolate both sisters within the castle. Elsa shuts out Anna, causing a rift between them. Elsa suppresses her magic rather than mastering it, causing her to become more insecure. When the sisters are teenagers, their parents die at sea during a storm. ", "2": "When Elsa turns twenty-one, she is to be crowned queen of Arendelle. She is terrified that the kingdom's citizens might find out about her powers and fear for her. The castle gates open to the public and visiting dignitaries for the first time in years. Amongst them is the scheming Duke of Weselton, and the dashing Prince Hans of the Southern Isles, with whom Anna falls head-over-heels in love. Elsa s coronation happens without a hitch, but she still remains distant from Anna. When Hans proposes to Anna, Elsa objects, accidentally unleashing her powers before the court. The Duke brands her a monster. Elsa flees the kingdom, but her suppressed magic engulfs Arendelle in an eternal winter. Reaching the North Mountain, Elsa discards her crown and creates a palace of ice in which to live a solitary life. ", "3": "Reaching the ice palace, Anna meets Elsa, but when she reveals what has become of Arendelle, Elsa becomes agitated, and accidentally freezes Anna's heart. She then summons a giant snow creature named Marshmallow, who chases Anna, Kristoff, and Olaf away. Anna's hair begins turning white, so Kristoff takes her to meet the trolls, his adoptive family. Grand Pabbie reveals that Anna will freeze solid unless 'an act of true love' reverses the spell. Kristoff races Anna back home so Hans can give her true love's kiss. Hans and his men reach Elsa's palace, defeating Marshmallow, and capturing Elsa. Anna is delivered to Hans, but rather than kissing her, he instead reveals that he has actually been plotting to seize the throne of Arendelle by eliminating both sisters. He locks Anna in a room to die, and manipulates the dignitaries into believing that Elsa killed her. He orders the queen's execution, only to discover she has escaped her detention cell. "}, "8": {"0": "cast: Gal Gadot as Diana Prince / Wonder Woman, an immortal Amazon warrior who is the crown princess of Themyscira, and the daughter of Queen Hippolyta and Zeus given to the Amazons to raise, and half-sister of Ares. Chris Pine as Steve Trevor, an American pilot and the love interest of Diana. Robin Wright as Antiope, the sister of Hippolyta, General of the Amazonian army, Diana's aunt and mentor. Danny Huston as General Erich Ludendorff, an iron-fisted general of the German Army during World War I.. critical_response: Never prone to stewing in solitude, and taking more notes from Richard Donner than from Christopher Nolan, Patty Jenkins' Wonder Woman provides a welcome respite from DC's house style of grim darkness boisterous, earnest, sometimes sloppy, yet consistently entertaining with star Gal Gadot proving an inspired choice for this avatar of truth, justice, and the Amazonian way. Wonder Woman is a war movie. Patty Jenkins' first and we hope not last entry into the DC Expanded Universe is primarily set  during World War I, but while the feature doesn't balk at war-time violence, it's the internal battles of its compelling  heroine that are most vital. Diana's scenes of action are thrilling precisely because they're meant to stop war, not to foment it; the idea of a demi-god using love to fight war might sound goofy in the abstract, but Jenkins makes the concept work.. director: Patty Jenkins. genre: Drama, Superhero. introduction: Wonder Woman is based on the DC Comics character of the same name, distributed by Warner Bros. Pictures.  It is the fourth installment in the DC Extended Universe(DCEU). Wonder Woman is the second live action theatrical film featuring the titular character, following her debut in 2016's Batman v Superman: Dawn of Justice. Jenkins's role as director makes her the first female director of a live-action, theatrically released comic book superhero film. The film tells the story of Princess Diana, who grows up on the Amazon island of Themyscira. After American pilot Steve Trevor crashes offshore of the island and is rescued by her, he tells the Amazons about the ongoing World War. Diana then leaves her home in order to end the conflict.. movieName: Wonder Woman. rating: Rotten Tomatoes: 92% and average: 7.6/10 Metacritic Score: 76/100 CinemaScore: A. year: 2015.", "1": "In present-day Paris, Diana Prince receives a photographic plate of herself and four men taken during World War I, prompting her to recall her past. Daughter of Queen Hippolyta, Diana was raised on the hidden island of Themyscira, home to the Amazonian warrior women created by Zeus to protect mankind. Hippolyta shares the Amazonian history with Diana, including how Ares, Zeus's son, became jealous of humanity and orchestrated its destruction. When the other gods attempted to stop him, Ares killed all but Zeus, who wounded Ares and forced his retreat. ", "2": "Initially forbidding Diana to train as a warrior, Hippolyta allows her sister Antiope to train Diana, only more rigorously than any other warrior. In 1918, Diana, now a young woman, rescues American pilot Captain Steve Trevor when his plane crashes off the Themysciran coast. The island is soon invaded by a German ship pursuing Trevor. The Amazons kill the crew, but Antiope sacrifices herself to save Diana. Steve is interrogated with the Lasso of Hestia, and reveals that a war is consuming the outside world, and that he is an Allied spy. He has stolen a notebook of the Spanish chief chemist Isabel Maru, who is attempting to engineer a deadlier form of mustard gas, under the orders of General Erich Ludendorff. Believing Ares to be responsible for the war, Diana arms herself with the 'Godkiller'sword, the lasso, and her armor before leaving Themyscira with Steve to find and destroy Ares. ", "3": "Sir Patrick appears and reveals himself as Ares. He tells Diana that although he has subtly given humans ideas and inspirations, using Ludendorff and Maru as pawns in the process, it is ultimately their decision to resort to violence as they are inherently corrupt. When Diana attempts to kill Ares with the 'Godkiller'sword, he destroys it, then reveals Diana to be the 'Godkiller', as the daughter of Zeus and Hippolyta. He fails to persuade Diana to help him destroy mankind to restore paradise on Earth. While the two battle, Steve's team destroys Maru's laboratory. Steve hijacks and pilots the bomber carrying the gas to a safe altitude and detonates it, sacrificing himself in the process. Ares attempts to direct Diana's rage and grief at Steve's death by convincing her to kill Maru, but the memories of her experiences with Steve cause her to realize that humans have good within them. She spares Maru and redirects Ares'lightning into him, killing him. Later, the team celebrates the end of the war. In the present day, Diana sends an email to Bruce Waynethanking him for the photographic plate of her and Steve, and reaffirms her new mission to fight and give on the world's behalf. "}, "18": {"0": "cast: Quinton Aaron as Michael \"Big Mike\" Oher Sandra Bullock as Leigh Anne Tuohy Tim McGraw as Sean Tuohy Jae Head as Sean \"S.J.\" Tuohy, Jr. Lily Collins as Collins Tuohy. critical_response: The film received moderately positive reviews, with critics praising Sandra Bullock's performance. It might strike some viewers as a little too pat, but The Blind Side has the benefit of strong source material and a strong performance from Sandra Bullock.. director: John Lee Hancock. genre: Biographical, Sports, Drama. introduction: The Blind Side is a 2009 American biographical sports drama film written and directed by John Lee Hancock, based on the 2006 book The Blind Side: Evolution of a Game by Michael Lewis.[2][3] The storyline features Michael Oher, an offensive lineman who was drafted by the Baltimore Ravens of the NFL. The film follows Oher from his impoverished upbringing, through his years at Wingate Christian School (a fictional representation of Briarcrest Christian School in Memphis, Tennessee),[4] his adoption by Sean and Leigh Anne Tuohy, to his position as one of the most highly coveted prospects in college football, then finally becoming a first-round pick of the Ravens.. movieName: The Blind Side. rating: Rotten Tomatoes: 69% and average: 6.1/10 Metacritic Score: 53/100 CinemaScore: A+. year: 2009.", "1": "Michael has been in foster care with different families in Memphis, Tennessee, due to his mother's drug addiction. Every time he is placed in a new home, he runs away. His friend's father, on whose couch Mike had been sleeping, asks Burt Cotton, the coach of Wingate Christian School, to help enroll his son and Mike. Impressed by Mike's size and athleticism, Cotton gets him admitted despite his poor academic record. Later, Michael is befriended by a younger student named Sean Jr. ('SJ'). SJ's mother, Leigh Anne Tuohy, is a strong-minded interior designer and the wife of wealthy businessman Sean Tuohy. ", "2": "Leigh Anne's friends wonder what she is doing; they suggest that Collins might not be safe around Michael, but Leigh Ann rebukes them. She later asks Collins how she feels about it. Collins replies that they cannot just throw Michael out. When Leigh Anne seeks to become Michael's legal guardian, she learns he was taken from his drug-addict mother when he was seven and that no one knows her whereabouts. She is also told that, although he scored poorly in a career aptitude test, he was ranked in the 98th percentile in 'protective instincts'. When Michael appears to be hesitant to use his strength and size while learning to play football, Leigh Anne tells him, as an offensive lineman, he must protect his quarterback. From that moment, Michael improves drastically, well enough to play at the college level. However, to do that, he must meet the minimum grade point average to get in so the Tuohys hire a private tutor for him, the outspoken and kind Miss Sue. ", "3": "Michael runs away before the interview is over and confronts Leigh Anne about her motives for taking him in. He then proceeds to find his biological mother in Hurt Village. A gang leader welcomes him back, offers him a beer, and makes sexually offensive insinuations about Leigh Anne and Collins. When the gang leader threatens to go after them, Michael battles with him and other thugs. After thinking things over and questioning Leigh Anne, Michael tells Granger he chose Ole Miss because 'it's where my family goes to school'. Michael is accepted into college and says his farewells to the Tuohy family. "}, "3": {"0": "cast: Ryan Gosling as Sebastian Wilder Emma Stone as Mia Dolan John Legend as Keith Callie Hernandez as Tracy. critical_response: succeeds both as a fizzy fantasy and a hard-headed fable, a romantic comedy and a showbiz melodrama, a work of sublime artifice and touching authenticity  Chazelle has crafted that rare thing, a genuinely romantic comedy, and as well, a rhapsody in blue, red, yellow and green. La La Land may look like the world that we dream about, but it also understands the cruelty that can come out of (or undermine) those dreams; it's shot in CinemaScope, and yet it's still an intimate masterpiece. the year's most seriously pleasurable entertainment ...the movie traffics in the bittersweet happiness of treasuring things that are vanishing, like the unrealized future imagined in the climatic dance number, or those inky, star-filled dance floors that go on forever in old movies, or Hollywood musicals themselves. Or jazz: Sebastian has an early moment at a nightclub where he passionately sticks up for the music he loves.  It's dying on the vine,  his quest (and eventual success) to save the traditionally black musical genre from extinction, seemingly the only person who can accomplish such a goal. the movie sags badly in the middle, like a worn-out mattress that needs new springs  the film is a little dull, that the two leads' singing and dancing aren't exceptional, and that Sebastian is a jazz snob and Mia's character lacks depth. . director: Damien Chazelle. genre: Musical, Drama, Romance. introduction: La La Land is a 2016 American musical romantic comedy-drama film written and directed by Damien Chazelle. It stars Ryan Gosling as a jazz pianist and Emma Stone as an aspiring actress, who meet and fall in love in Los Angeles while pursuing their dreams. The film's title refers simultaneously to music, the city of Los Angeles, and to the idiom for being out of touch with reality.. movieName: La la Land. rating: Rotten Tomatoes: 92% and average: 8.6/10  Metacritics: 93/100 IMDB: 8.1/10. year: 2016.", "1": "During a gig at a restaurant, Sebastian slips into a passionate jazz improvisation despite warnings from the owner to stick to the setlist of traditional Christmas songs. Mia overhears the music as she passes by ('Mia and Sebastian's Theme'). Moved, she enters the restaurant, but Sebastian is fired for his disobedience. As he storms out, Mia attempts to compliment him, but he brushes her off. Months later, Mia runs into Sebastian at a party where he plays in a 1980s pop cover band; she teases him by requesting 'I Ran (So Far Away)', a song he considers an insult for 'a serious musician'. After the gig, the two walk to their cars, lamenting each other's company despite the chemistry between them ('A Lovely Night'). ", "2": "After more failed auditions, Mia decides, at Sebastian's suggestion, to write a one-woman play. Sebastian begins to perform regularly at a jazz club ('Summer Montage'), and the two move in together. Sebastian's former classmate Keith invites him to be the keyboardist in his jazz fusion band, where he will be offered a steady income. Although he is dismayed by the band's pop style, Sebastian signs after overhearing Mia trying to convince her mother that Sebastian is working on his career. The band finds success, but when Mia attends one of their concerts ('Start a Fire') she is disturbed, knowing Sebastian does not enjoy their music. ", "3": "During the band's first tour, Mia and Sebastian get into an argument; she accuses him of abandoning his dreams, while he claims she liked him more when he was unsuccessful. Mia leaves, insulted and frustrated. Sebastian misses Mia's play due to a band photo shoot that he had previously forgotten. The play is a disaster; few people attend, and Mia overhears dismissive comments. Sebastian attempts to apologize to Mia for missing the play, but she is unwilling to forgive him and ends their relationship. Despondent and unable to pay the theater back, Mia moves back home to Boulder City, Nevada. "}, "22": {"0": "cast: Angelina Jolie as Maleficent Sharlto Copley as Stefan Elle Fanning as Aurora Sam Riley as Diaval Imelda Staunton as Knotgrass. critical_response: Maleficent' demolishes stereotypes that were only tweaked in 'Frozen [it] surprises not for its baroque visions of a colourful woodland enlivened by joyous fairies and a forbidding castle peopled by unhappy humans, but rather for the thematic richness of its story gloriously personified by Angelina Jolie in the title role. there's a lot of levitating cliffs and odd flora. But despite their bleeding-edge digital design, the backgrounds have all the depth of the old matte-painted backgrounds of the analog days, Still, for all its limitations, 'Maleficent' manages to be improbably entertaining to watch, due solely to its title character.. director: Robert Stromberg. genre: SuperHero. introduction: Maleficent is a 2014 American dark fantasy film directed by Robert Stromberg from a screenplay by Linda Woolverton, and starring Angelina Jolie as Maleficent with Sharlto Copley, Elle Fanning, Sam Riley, Imelda Staunton, Juno Temple, and Lesley Manville in supporting roles. Loosely inspired by Charles Perrault's original fairy tale and Walt Disney's 1959 animated film Sleeping Beauty, the film portrays the story from the perspective of the eponymous antagonist, depicting her conflicted relationship with the princess and king of a corrupt kingdom.. movieName: Maleficent. rating: Rotten Tomatoes: 51% and average: 5.7/10 Metacritic Score: 56/100 CinemaScore: A. year: 2014.", "1": "Maleficent is a powerful fairy living in the Moors, a magical forest realm bordering a human kingdom. As a young girl, she meets and falls in love with a human peasant boy named Stefan, whose love for Maleficent is overshadowed by his ambition. As they become older, the two grow apart, and Maleficent becomes protector of the Moors. When King Henry tries to conquer the Moors, Maleficent mortally wounds him and forces him to retreat. As he lies dying, he declares that whoever kills Maleficent will be named his successor and marry his daughter, Princess Leila. Stefan visits Maleficent in the Moors. He drugs her, but cannot bring himself to kill her. Instead, he cuts off her wings with iron, which is lethal to fairies, and presents them to the king. Devastated by Stefan's betrayal, Maleficent turns the Moors into a dark kingdom. She finds a raven named Diaval to act as her wings, spy and confidant. She transforms him into different forms as needed, including human. ", "2": "Despite her initial dislike for Aurora, Maleficent begins to care for her when the bumbling and neglectful pixies fail to do so. After a brief meeting with the young Aurora, Maleficent watches over her from afar. When Aurora is fifteen, she encounters Maleficent. Knowing that she is being watched over, she calls Maleficent her 'fairy godmother.' Maleficent tries desperately to undo the curse but is unsuccessful, as the curse proves to be unbreakable by any means other than true love's kiss. In the forest, Aurora meets Prince Philip, and the two are attracted to each other. On the day before Aurora's sixteenth birthday, Aurora tells Maleficent that she would like to live with her in the Moors. When Aurora returns to the cottage, the pixies inadvertently tell Aurora of her past. Having learned of Maleficent's true identity, Aurora runs to her father's castle. ", "3": "After a brief reunion with his daughter, Stefan locks her away in a room for her own safety while setting up a plan to kill Maleficent. However, the power of the curse draws Aurora to the dungeon, where a spinning wheel magically reassembles itself. She pricks her finger and falls into a deep sleep, fulfilling the curse. Maleficent, intent on saving Aurora, abducts Phillip and infiltrates Stefan's castle, but Phillip's kiss fails to awaken Aurora. At her bedside, Maleficent apologizes to Aurora and kisses her forehead. Aurora awakens, as Maleficent's motherly feelings towards her count as true love. However, as Maleficent and Aurora attempt to leave, they are ambushed by Stefan and his guards, with an iron net dropping on her. Maleficent transforms Diaval into a dragon, and he battles Stefan's guards, but he is eventually caught as well. Stefan taunts Maleficent, who is dizzy and sick from the iron, his former love for her fully gone, but before he can deliver a killing blow, Aurora finds her wings and releases them. They fly to Maleficent and reattach themselves. Maleficent carries Stefan to the top of the castle's highest tower and beats him easily and quickly in battle, but cannot bring herself to kill him. Stefan attacks her as she turns away, however, and both plummet from the tower. Maleficent breaks away and sends Stefan to his death. "}, "9": {"0": "cast: Fionn Whitehead as Tommy, a British Army private Whitehead was cast in the lead after a secretive auditioning process lasting several months. His character was named after the slang term for the ordinary British soldier. Tom Glynn-Carney as Peter, Mr Dawson's son Jack Lowden as Collins, a Royal Air Force Spitfire pilot Harry Styles as Alex, a private in the Argyll and Sutherland Highlanders Styles won the role after auditioning against hundreds of candidates, when Nolan was unaware of his renown as a singer. Aneurin Barnard as \"Gibson\", a French soldier masquerading as a British Army private.. critical_response: surrounds his audience with chaos and horror from the outset, and amazing images and dazzlingly accomplished set pieces on a huge 70mm screen, particularly the pontoon crammed with soldiers extending into the churning sea, exposed to enemy aircraft an impressionist masterpiece' that was 'deeply moving' but without 'manufactured sentimentality or false heroics. There's little doubt that [Nolan] has, without sentimentality or sanctimony, raised that genre to the level of art...with the resonant force of an enduring screen classic.  'tight, gripping, deeply involving and unforgettable ... triumph in filmmaking  '[Dunkirk] is 106 clamorous minutes of big-screen bombast that's so concerned with its own spectacle and scale that it neglects to deliver the most crucial element drama.. director: Christopher Nolan. genre: War. introduction: Dunkirk is a 2017 war film written, directed, and co-produced by Christopher Nolan that depicts World War II's Dunkirk evacuation. Dunkirk portrays the evacuation from three perspectives: land, sea, and air. It has little dialogue, since Nolan sought to create suspense from cinematography and music. Filming began in May 2016 in Dunkirk and ended that September in Los Angeles, when post-production began. Cinematographer Hoyte van Hoytema shot the film on IMAX 65 mm and 65 mm large format film stock. Dunkirk has extensive practical effects, using thousands of extras, boats that participated in the evacuation, and period aeroplanes.. movieName: Dunkirk. rating: Rotten Tomatoes: 92% and average: 8.6/10 Metacritic Score: 94/100 CinemaScore: A-. year: 2017.", "1": "In 1940, during the fall of France, hundreds of thousands of Allied soldiers have retreated to Dunkirk. Tommy, a young British private, is the sole survivor of a German ambush. At the beach, he finds thousands of troops awaiting evacuation and meets Gibson, who is burying a body. After a German dive-bomber attack, they find a wounded man. They rush his stretcher onto a hospital ship, but are denied passage themselves. The ship is sunk by dive-bombers; Tommy saves Alex, another soldier. They leave at night on a destroyer, which is sunk by a torpedo from a U-Boat. Gibson saves Tommy and Alex, and they are brought ashore by a rowing boat. The British navy requisitions civilian vessels that can get close to the beach. In Weymouth, Mr. Dawson and his son Peter set out on his boat Moonstone rather than let the navy take it. Impulsively, their teenage friend George joins them. At sea, they rescue a shell-shocked officer from a wrecked ship. When he realises that Dawson is sailing for Dunkirk, the officer demands that they turn back, and tries to wrest control of the boat; in the struggle, George suffers a head injury that renders him blind. ", "2": "Tommy, Alex and Gibson join a group of Scottish soldiers and hide inside a trawler until the tide rises. Its owner, a Dutch mariner, returns. German troops shoot at the boat for target practice; when the tide rises, water enters through the bullet holes. Alex, hoping to lighten the boat's load, accuses Gibson, who has been silent, of being a spy and demands that he leave. Gibson reveals he is French; he had stolen the identity of the soldier he buried, hoping to evacuate with the British. Alex, Tommy and the Scottish soldiers abandon the fishing boat when it begins to sink. Gibson is entangled in a chain and drowns. Alex and Tommy swim towards a nearby destroyer, but it is sunk by a bomber. The Moonstone manoeuvres to take on troops, including Alex and Tommy. Peter realises that George is dead; when asked by the shell-shocked officer, he lies that George will be fine. Farrier shoots down the bomber, which crashes and ignites the oil slick from the sinking destroyer. Peter reveals to Collins that his elder brother was a Hurricane pilot, killed early in the war.  ", "3": "At the beach, Commander Bolton watches the last British soldiers leave. He confirms that 300,000 have been evacuated, ten times more than estimated. He remains to oversee the evacuation of the French rearguard. Alex and Tommy cross the English Channel and board a train in Weymouth. Dawson is congratulated for having saved so many men. The shell-shocked officer sees George's body being carried away. Peter visits the local newspaper with a photograph of George; a front-page article later commends George as a hero. Alex expects public scorn as the train approaches Woking, but they receive a hero's welcome. Tommy reads out Winston Churchill's address to the nation from a newspaper. "}, "11": {"0": "cast: Lindsay Lohan as Cady Heron Rachel McAdams as Regina George Lacey Chabert as Gretchen Wieners Amanda Seyfried as Karen Smith Lizzy Caplan as Janis Ian. critical_response: Boasts a one-two-three punch in star Lindsay Lohan, screenwriter Tina Fey and director Mark Waters, and, indeed, it delivers a knockout The screenplay was highly praised by critics with Peter Travers of Rolling Stone calling it 'comic gold'. In November 2012, Rotten Tomatoes named it in its 'Top 50 Greatest Teen Comedies'.. director: Mark Waters . genre: Comedy, teeny. introduction: Mean Girls is a 2004 American teen comedy film directed by Mark Waters and written by Tina Fey. The film is partially based on Rosalind Wiseman's 2002 non-fiction self-help book Queen Bees and Wannabes, which describes female high school social cliques and the damaging effects they can have on girls.. movieName: Mean Girls. rating: Rotten Tomatoes: 84% and average: 6.9/10 Metacritic Score: 66/100 CinemaScore: A-. year: 2004.", "1": "Sixteen-year-old homeschooled Cady Heron and her zoologist parents return to the United States after a twelve-year research trip in Africa, settling down in Evanston, Illinois. Attending a public school for the first time, Cady meets new classmates Janis Ian and Damian Leigh. Janis and Damian educate Cady on the school's various cliques and warn her to avoid the most popular and infamous one, the 'Plastics', who are led by queen bee Regina George and include insecure rich girl Gretchen Wieners and sweet but dimwitted Karen Smith. The Plastics take an interest in Cady, and invite her to sit with them at lunch. Seeing that Cady is getting along with the Plastics, Janis hatches a plan of revenge against Regina for some past slight, using Cady as the infiltrator. ", "2": "When Regina is finally made aware of Cady's treachery, she retaliates by spreading the contents of her Burn Book all over the school, quickly inciting a massive brawl. To avoid suspicion, Regina inserts a fake libel of herself in the book in order to blame Cady, Gretchen, and Karen, the only female students not mentioned in the book. Karen convinces Principal Duvall that they did not spread the book. Duvall soon quells the fighting, and gathers all the girls in the school in the gymnasium. Math teacher Ms. Norbury, whom the Burn Book defamed as a drug dealer, makes the girls face the ways they all treat each other, confess their transgressions, and apologize to each other and the teachers. When Janis's turn comes, she defies Norbury and confesses her plan to destroy Regina with Cady's help, and openly mocks Regina with the support of the entire school. Pursued by an apologetic Cady, Regina storms out and is struck by a school bus, breaking her spine. ", "3": "Without any friends, shunned by Aaron, grounded by her parents and despised by her peers at school, Cady takes full blame for the Burn Book and becomes an outcast. After she makes amends with Regina, Cady's guilt soon dissolves and she returns to her old personality. As part of her punishment for lying and failing Ms. Norbury's class, she joins the Mathletes in the state championship finals, and ends up winning the competition for her team after her opponent answers incorrectly. At the Spring Fling dance, Regina's new boyfriend, Shane Oman, is elected King, while Cady is elected Queen. Onstage, Cady declares that all her classmates are wonderful in their own way, breaks her plastic tiara, and distributes the pieces to some other girls. She then reconciles with Janis, Damian, and Aaron, and reaches a truce with the Plastics. "}, "16": {"0": "cast: Steve Carell as Gru, a mean supervillain Jason Segel as Victor \"Vector\" Perkins, Mr. Perkins' son and Gru's archenemy Russell Brand as Dr. Nefario, Gru's elderly gadget man and a friendly scientist. critical_response: Since villains so often steal the show in animation, Despicable Me smartly turns the whole operation over to megalomaniacal rogue Gru. Despicable Me is a 3D cartoon comedy of whiplash-quick laughs, funny punch lines and a wickedly gimmicky appreciation for 3D. Kids will dig it, adults will smile with amusement, and no one will be any different afterward than they were walking into the theater. Short, sweet-and-sour, and amusing rather than funny, Despicable Me can't help but be likable. It's no first-rank CGI cartoon, but shows how Pixar's quality over crass is inspiring the mid-list. Fun, with teary bits, for kids; fresh and smart for adults.. director: Pierre Coffin, Chris Renaud. genre: Animation. introduction: Despicable Me is a 2010 American 3D computer-animated comedy film from Universal Pictures and Illumination Entertainment that was released on July 9, 2010, in the United States. It is the debut film of Illumination Entertainment. The film was animated by the French animation studio Mac Guff, which was later acquired by Illumination Entertainment.[6] It was directed by Pierre Coffin and Chris Renaud as their feature debut film, with a story by Sergio Pablos. The title references the main character as he refers to himself, and is accompanied by a song by Pharrell.. movieName: Despicable Me. rating: Rotten Tomatoes:81% and average: 6.8/10 Metacritic Score: 72/100 CinemaScore: A. year: 2010.", "1": "Gru, a supervillain, is disheartened when an unknown supervillain steals the Great Pyramid of Giza. Gru, with the assistance of his colleague Dr. Nefario and his Minions, resolves to one-up this mystery rival by shrinking and stealing the Moon. As it would be costly to steal the moon, Gru seeks a loan from the Bank of Evil. Bank president Mr. Perkins is impressed by the plan but will provide the money only if Gru can obtain the necessary shrink ray first. Upon learning that an up-and-coming villain named Vector was responsible for the pyramid theft, Gru starts a rivalry with him. ", "2": "Eventually, Gru and the girls arrive at Vector's fortress, and Gru steals the shrink ray. The girls then suggest a day at a theme park; Gru agrees, believing he can abandon the girls there, but instead he warms up to them. Later, Gru contacts Perkins via video chat, stating that he finally has the shrink ray. Margo, Edith, and Agnes interrupt the meeting, and Perkins announces that he has lost confidence in Gru and will no longer fund his operations. As Gru tells the Minions he can no longer pay them for their services, the girls offer the contents of their piggy bank. Gru, inspired, sells parts of his lair to construct a spacecraft. Gru plans to steal the Moon when it is nearest the Earth, but this is the same day as the girls' ballet recital. Gru becomes conflicted, and Dr. Nefario, seeing the recital as interfering with the plan, arranges for the girls to be returned to the orphanage. At the same time, Perkins informs Vector, revealed to be Perkins' son, of Gru's possession of the shrink ray and the adoption of the three girls, encouraging Vector to act. ", "3": "Gru successfully shrinks and steals the Moon, and rushes back to Earth to attend the recital only to find a ransom note from Vector, who has kidnapped the girls. After arriving at Vector's headquarters, Gru surrenders the Moon, but Vector reneges on the deal, flying off with the girls and the Moon. Meanwhile, Dr. Nefario has discovered that the effects of the shrink ray are temporary; the bigger the object's original size, the faster the shrinkage will wear off. As the Moon starts to expand in Vector's ship, Gru, Dr. Nefario, and the Minions execute a daring mid-air rescue of the girls just as the Moon explodes out of Vector's ship and launches itself back into orbit, with Vector trapped on it. "}, "4": {"0": "cast: Ginnifer Goodwin as Officer Judy Hopps, an optimistic rabbit from Bunnyburrow who is a newly appointed member of the Zootopia Police Department assigned to the 1st Precinct. Jason Bateman as Nick Wilde, a red fox who is a small-time con artist. Idris Elba as Chief Bogo, an African buffalo who is the police chief of the Zootopia Police Department's 1st Precinct. Jenny Slate as Dawn Bellwether, a diminutive sheep who is the assistant mayor of Zootopia.. critical_response: The brilliantly well-rounded Zootopia offers a thoughtful, inclusive message that's as rich and timely as its sumptuously state-of-the-art animation   all while remaining fast and funny enough to keep younger viewers entertained. funny, smart, [and] thought-provoking.   'very funny, and very likable holiday treat. [Zootopia] is constantly asking its characters to look past species stereotypes, and not use species-ist language or repeat hurtful assumptions.... This all seems clever and noble until you realize that all the stereotypes about various animals are to some extent true, in particular the most basic one: carnivores eat herbivores because it's in their nature.. director: Byron Howard, Rich Moore. genre: Comedy, Adventure, Animation. introduction: In a world populated by anthropomorphic mammals, Judy Hopps from rural Bunnyburrow fulfills her childhood dream of becoming a police officer in urban Zootopia. Despite being the academy valedictorian, Judy is delegated to parking duty by Chief Bogo, who doubts her potential because she is a rabbit. On her first day, she is hustled by a con artist fox duo, Nick Wilde and Finnick.. movieName: Zootopia. rating: Rotten Tomatoes: 98% and average: 8/10 IMDB: 8/1. year: 2016.", "1": "After determining Nick was a suspect seen in Otterton's last known sighting, Judy blackmails him into assisting her by covertly recording his confession to tax evasion with her carrot pen. They track Otterton to a limousine owned by crime boss Mr. Big, who reveals Otterton went 'savage'   reverted to a feral state   and attacked his chauffeur Manchas. At his home, Manchas mentions Otterton yelled about 'night howlers' before the attack. Moments later, Manchas himself turns savage and chases the pair. Judy saves Nick by trapping Manchas and calls the ZPD for help, but when they arrive, Manchas has vanished. Bogo demands Judy's resignation, but Nick reminds Bogo that Judy still has ten hours to solve the case. Judy learns from Nick that he was bullied as a child when he tried to join the Ranger Scouts, who stereotyped him as untrustworthy for being a fox. ", "2": "At City Hall, Bellwether offers Judy and Nick access to the city's traffic cameras. They discover Manchas was captured by wolves, who Judy surmises are the 'night howlers'. They locate the missing predators - all gone savage - imprisoned at Cliffside Asylum, where Mayor Leodore Lionheart hides them from the public while a scientist tries to determine the cause of their behavior. Lionheart and those involved are arrested for false imprisonment and Bellwether becomes the new mayor.  Judy, praised for solving the case, has become friends with Nick and asks him to join the ZPD as her partner. However, she upsets him at a press conference by suggesting a predatory biological cause for the recent savage behavior, and her comments cause tension between predators and prey throughout the city. Feeling guilty for the results of her words, Judy quits her job. ", "3": "Back in Bunnyburrow, Judy learns that the night howlers are actually toxic flowers that have severe psychotropic effects on mammals. After returning to Zootopia and reconciling with Nick, the pair confront Weaselton, who tells them the bulbs he stole were for a ram named Doug. They find Doug in a laboratory hidden in the city subway, developing a drug made from night howlers, which he has been shooting at predators with a dart gun.  Judy and Nick obtain the serum as evidence, but before they can reach the ZPD, Bellwether confronts them in the Natural History Museum and takes the evidence, revealing herself as the mastermind behind a prey-supremacist conspiracy. Judy and Nick are trapped after Nick refuses to abandon an injured Judy. Bellwether shoots a serum pellet at Nick to make him kill Judy, and summons the ZPD for help, but Judy and Nick have replaced the serum pellets in Bellwether's gun with blueberries. Enraged, Bellwether threatens to frame the pair for the attacks, but Judy has recorded Bellwether's confession. Bogo and the ZPD arrive and Bellwether is arrested. "}, "1": {"0": "cast: Benedict Cumberbatch as Alan Turing Keira Knightley as Joan Clarke Matthew Goode as Hugh Alexander Tom Goodman-Hill as Sgt. Staehl. critical_response: one of the most important stories of the last century is one of the greatest movies of 2014 Empire described it as a 'superb thriller' and Glamour declared it 'an instant classic'. Peter Debruge of Variety added that the film is 'beautifully written, elegantly mounted and poignantly performed'. movie is undeniably strong in its sense of a bright light burned out too soon, and the often undignified fate of those who dare to chafe at society's established norms The Hollywood Reporter reported that the highlight of the film was Cumberbatch, 'whose charisma, tellingly modulated and naturalistic array of eccentricities, talent at indicating a mind never at rest and knack for simultaneously portraying physical oddness and attractiveness combine to create an entirely credible portrait of genius at work I discovered that The Imitation Game takes major liberties with its source material, injecting conflict where none existed, inventing entirely fictional characters, rearranging the chronology of events, and misrepresenting the very nature of Turing's work at Bletchley Park'. Andrew Grant of Science News wrote, '... like so many other Hollywood biopics, it takes some major artistic license   which is disappointing, because Turing's actual story is so compelling. . director: Morten Tyldum. genre: Drama, biopic. introduction: The Imitation Game is a 2014 American historical drama film directed by Morten Tyldum and written by Graham Moore, loosely based on the biography Alan Turing: The Enigma by Andrew Hodges (which was previously adapted as the stage play and BBC drama Breaking the Code). It stars Benedict Cumberbatch as real-life British cryptanalyst Alan Turing, who decrypted German intelligence codes for the British government during the Second World War. Keira Knightley, Matthew Goode, Rory Kinnear, Charles Dance and Mark Strong also star.. movieName: Imitation Game. rating: Rotten Tomatoes: 91% and average: 7.7/10 Metacritic Score: 73/100 CinemaScore: A+. year: 2014.", "1": "In 1951, two policemen, Nock and Staehl, investigate the mathematician Alan Turing after an apparent break-in at his home. During his interrogation by Nock, Turing tells of his time working at Bletchley Park. In 1927, the young Turing is unhappy and bullied at boarding school. He develops a friendship with Christopher Morcom, who sparks his interest in cryptography, and Turing develops romantic feelings for him. Before Turing can confess his love, Christopher dies unexpectedly from tuberculosis. When Britain declares war on Germany in 1939, Turing travels to Bletchley Park, where, under the direction of Commander Alastair Denniston, he joins the cryptography team of Hugh Alexander, John Cairncross, Peter Hilton, Keith Furman and Charles Richards. The team are trying to decrypt the Enigma machine, which the Nazis use to send coded messages. ", "2": "Turing s machine, which he names Christopher, is constructed, but cannot determine the Enigma settings before the Germans reset the Enigma encryption each day. Denniston orders it destroyed and Turing fired, but the other cryptographers threaten to leave if Turing goes. After Clarke plans to leave on the wishes of her parents, Turing proposes marriage, which she accepts. During their reception, Turing confirms his homosexuality to Cairncross, who warns him to keep it secret. After overhearing a conversation with a female clerk about messages she receives, Turing has an epiphany, realising he can program the machine to decode words he already knows exist in certain messages. After he recalibrates the machine, it quickly decodes a message and the cryptographers celebrate; however, Turing realises they cannot act on every decoded message or the Germans will realise Enigma has been broken. ", "3": "Turing discovers that Cairncross is a Soviet spy. When Turing confronts him, Cairncross argues that the Soviets are allies working for the same goals, and threatens to retaliate by disclosing Turing s homosexuality if his role as an agent is revealed. When the MI6 agent Stewart Menzies appears to threaten Clarke, Turing reveals that Cairncross is a spy. Menzies reveals he knew this already, and planted Cairncross among them in order to leak messages to the Soviets for British benefit. Fearing for her safety, Turing tells Clarke to leave Bletchley Park, revealing that he is gay and lying about never having cared for her. After the war, Menzies tells the cryptographers to destroy their work and that they can never see one another again or share what they have done. "}, "27": {"0": "cast: Sally Hawkins as Elisa Esposito, a mute cleaner who works at a secret government laboratory. Michael Shannon as Colonel Richard Strickland, a corrupt military official in charge of the project to study the \"asset\". Richard Jenkins as Giles, Elisa's closeted neighbor and close friend who is a struggling advertising illustrator. Octavia Spencer as Zelda Delilah Fuller, Elisa's co-worker and friend who serves as her interpreter. Michael Stuhlbarg as Dimitri Mosenkov, a Soviet spy working as a scientist studying the creature, under the alias \"Dr. Robert Hoffstetler\".. critical_response: one of del Toro's most stunningly successful works... also a powerful vision of a creative master feeling totally, joyously free. Even as the film plunges into torment and tragedy, the core relationship between these two unlikely lovers holds us in thrall. Del Toro is a world-class film artist. There's no sense trying to analyze how he does it. The Shape of Water has tenderness uncommon to del Toro films. ... While The Shape of Water isn't groundbreaking, it is elegant and mesmerizing. refer Sally Hawkins' mute character as 'mentally handicapped' and for erroneously crediting actor Benicio del Toro as director.. director: Guillermo del Toro. genre: Fantasy, Drama. introduction: The Shape of Water is a 2017 American fantasy drama film directed by Guillermo del Toro and written by del Toro and Vanessa Taylor. It stars Sally Hawkins, Michael Shannon, Richard Jenkins, Doug Jones, Michael Stuhlbarg, and Octavia Spencer. Set in Baltimore in 1962, the story follows a mute custodian at a high-security government laboratory who falls in love with a captured humanoid amphibian creature.. movieName: The Shape of Water. rating: Rotten Tomatoes: 92% and average: 8.4/10 Metacritic Score: 87/100 CinemaScore: A. year: 2017.", "1": "Elisa Esposito, who as an orphaned child, was found in a river with wounds on her neck, is mute, and communicates through sign language. She lives alone in an apartment above a cinema, and works as a cleaning-woman at a secret government laboratory in Baltimore at the height of the Cold War. Her friends are her closeted next-door neighbor Giles, a struggling advertising illustrator who shares a strong bond with her, and her co-worker Zelda, a woman who also serves as her interpreter at work.  The facility receives a mysterious creature captured from a South American river by Colonel Richard Strickland, who is in charge of the project to study it. Curious about the creature, Elisa discovers it is a humanoid amphibian. She begins visiting him in secret, and the two form a close bond. ", "2": "Elisa keeps the creature in her bathtub, adding salt to the water to keep him alive. She plans to release the creature into a nearby canal when it will be opened to the ocean in several days' time. As part of his efforts to recover the creature, Strickland interrogates Elisa and Zelda, but the failure of his advances toward Elisa hampers his judgment, and he dismisses them. Back at the apartment, Giles discovers the creature devouring one of his cats, Pandora. Startled, the creature slashes Giles's arm and rushes out of the apartment. The creature gets as far as the cinema downstairs before Elisa finds him and returns him to her apartment. The creature touches Giles on his balding head and his wounded arm; the next morning, Giles discovers his hair has begun growing back and the wounds on his arm have healed. Elisa and the creature soon become romantically involved, having sex in her bathroom, which she at one point fills completely with water. ", "3": "Hoyt gives Strickland an ultimatum, asking him to recover the creature within 36 hours. Meanwhile, Mosenkov is told by his handlers that he will be extracted in two days. As the planned release date approaches, the creature's health starts deteriorating. Mosenkov leaves to rendezvous with his handlers, with Strickland tailing him. At the rendezvous, Mosenkov is shot by one of his handlers, but Strickland shoots the handlers dead and then tortures Mosenkov for information. Mosenkov implicates Elisa and Zelda before dying from his wounds. Strickland then threatens Zelda in her home, causing her terrified husband to reveal that Elisa had been keeping the creature. Strickland searches Elisa's apartment and finds a calendar note revealing when and where she plans to release him. At the canal, Elisa and Giles bid farewell to the creature, but Strickland arrives and attacks them all. Strickland knocks Giles down and shoots the creature and Elisa, who both appear to die. However, the creature heals himself and slashes Strickland's throat, killing him. As police arrive on the scene with Zelda, the creature takes Elisa and jumps into the canal, where, deep under water, he heals her. When he applies his healing touch to the scars on her neck, she starts to breathe through gills. In a closing voiceover narration, Giles conveys his belief that Elisa lived 'happily ever after' with the creature. "}, "21": {"0": "cast: Robert Downey Jr. as Tony Stark/Iron Man, an industrialist, genius inventor, and consummate playboy, he is CEO of Stark Industries and a chief weapons manufacturer for the U.S. military. Terrence Howard as James \"Rhodey\" Rhodes, a friend of Stark's, and the liaison between Stark Industries and the United States Air Force in the department of acquisitions, specifically weapons development.  Jeff Bridges as Obadiah Stane, Stark's business second-in-command, mentor and friend who turns on him to overtake the company, eventually building a giant exosuit to fight Stark.  Shaun Toub as Yinsen, Stark's fellow captive, who grafts an electromagnet to Stark's chest \"to keep the shrapnel shell shards that wounded him from reaching his heart and killing him\", and who helps Stark build the first Iron Man suit. Gwyneth Paltrow as Pepper Potts, Stark's personal assistant and budding love interest.. critical_response: expansively entertaining special effects extravaganza' with 'fresh energy and stylistic polish impressive sets and mechanics that combine smoothly with relatively seamless CG a shapely piece of mythmaking [...] Favreau doesn't go in for stylized comic-book frames, at least in the first half. He gets real with it   you'd think you were watching a military thriller a slightly depressed, going-through-the-motions feel to the entire show [...] Gwyneth Paltrow, widening her eyes and palpitating, can't do much with an antique role as Stark's girl Friday, who loves him but can't say so; Terrence Howard, playing a military man who chases around after Stark, looks dispirited and taken for granted. director: Jon Favreau. genre: SuperHero. introduction: Iron Man is a 2008 American superhero film based on the Marvel Comics character of the same name, produced by Marvel Studios and distributed by Paramount Pictures.1 It is the first film in the Marvel Cinematic Universe (MCU). The film was directed by Jon Favreau, with a screenplay by the writing teams of Mark Fergus and Hawk Ostby and Art Marcum and Matt Holloway. It stars Robert Downey Jr. as Tony Stark / Iron Man, alongside Terrence Howard, Jeff Bridges, Shaun Toub, and Gwyneth Paltrow. In Iron Man, Tony Stark, an industrialist and master engineer, builds a powered exoskeleton and becomes the technologically advanced superhero Iron Man. movieName: Iron Man. rating: Rotten Tomatoes: 94% and average: 7.7/10 Metacritic Score: 79/100 CinemaScore: A. year: 2008.", "1": "Genius, billionaire, and playboy Tony Stark, who has inherited the defense contractor Stark Industries from his father, is in war-torn Afghanistan with his friend and military liaison Lieutenant Colonel James Rhodes to demonstrate the new 'Jericho' missile. After the demonstration, the convoy is ambushed and Stark is critically wounded by one of his own company's rocket-propelled grenades. He is captured and imprisoned in a cave by a terrorist group, the Ten Rings; Yinsen, a fellow captive who is a doctor, implants an electromagnet into Stark's chest to keep the shrapnel shards that wounded him from reaching his heart and killing him. Ten Rings leader Raza offers Stark freedom in exchange for building a Jericho missile for the group, but Tony and Yinsen know that Raza will not keep his word. ", "2": "At a charity event held by Stark Industries, reporter Christine Everhart informs Stark that his company's weapons, including the Jericho, were recently delivered to the Ten Rings and are being used to attack Yinsen's home village, Gulmira. Stark then learns that Stane has been arms trafficking to criminals worldwide, and is staging a coup to replace him as Stark Industries' CEO. Stark dons his new armor and flies to Afghanistan, where he saves the villagers. While flying home, Stark is shot at by two F-22 Raptor fighter jets. He reveals his secret identity to Rhodes over the phone in an attempt to end the attack. Meanwhile, the Ten Rings gather the pieces of Stark's prototype suit and meet with Stane, who subdues Raza and has the rest of the group killed. Stane has a massive new suit reverse engineered from the wreckage. Seeking to track his company's illegal shipments, Stark sends Pepper to hack into its database. She discovers Stane hired the Ten Rings to kill Stark, but the group reneged. Potts meets with Agent Phil Coulson of S.H.I.E.L.D., an intelligence agency, to inform him of Stane's activities. ", "3": "Stane's scientists cannot duplicate Stark's miniaturized arc reactor, so Stane ambushes Stark at his home and takes the one from his chest. Stark manages to get to his original reactor to replace it. Potts and several S.H.I.E.L.D. agents attempt to arrest Stane, but he dons his suit and attacks them. Stark fights Stane, but is outmatched without his new reactor to run his suit at full capacity. The fight carries Stark and Stane to the top of the Stark Industries building, and Stark instructs Potts to overload the large arc reactor powering the building. This unleashes a massive electrical surge that causes Stane and his armor to fall into the exploding reactor, killing him. The next day, at a press conference, Stark defies suggestions from S.H.I.E.L.D. and publicly admits to being the superhero the press has dubbed 'Iron Man'. "}, "26": {"0": "cast: Meryl Streep as Katharine Graham Tom Hanks as Ben Bradlee Sarah Paulson as Antoinette \"Tony\" Pinchot Bradlee Bob Odenkirk as Ben Bagdikian Tracy Letts as Fritz Beebe. critical_response: The Post passes the trickiest tests of a historical drama: It makes us understand that decisions that have been validated by the lens of history were difficult ones to make in the moment, and it generates suspense over how all the pieces fell into place to make those decisions come to fruition. Nobody needs to be reminded that history tends to go in circles, but The Post is so vital because it captures the ecstasy of trying to break the chain and bend things towards justice; defending the fundamental tenets of the Constitution hasn't been this much fun since Hamilton. has all the makings of an awards season hit, but is too calculated to reflect today's ragged, tenuous sociopolitical climate. Spielberg makes these crucial days in American history easy to follow. But if you look at The Post next to something like All the President's Men, you see the difference between having a story passively explained to you and actively helping to untangle it. That's a small quibble with an urgent and impeccably acted film. But it's also the difference between a very good movie and a great one.. director: Steven Spielberg. genre: Historical, Political. introduction: The Post is a 2017 American historical political thriller film directed and produced by Steven Spielberg and written by Liz Hannah and Josh Singer. It stars Meryl Streep as Katharine Graham, the first female publisher of a major American newspaper, and Tom Hanks as Ben Bradlee, the executive editor of The Washington Post, with Sarah Paulson, Bob Odenkirk, Tracy Letts, Bradley Whitford, Bruce Greenwood, Carrie Coon, and Matthew Rhys in supporting roles. Set in the early 1970s, The Post depicts the true story of attempts by journalists at The Washington Post to publish the Pentagon Papers, classified documents regarding the 30-year involvement of the United States government in the Vietnam War.. movieName: The Post. rating: Rotten Tomatoes: 88% and average: 7.9/10 Metacritic Score: 83/100 CinemaScore: A. year: 2017.", "1": "In 1966 Vietnam, State Department military analyst Daniel Ellsberg accompanies U.S. troops in combat, documenting the progress of U.S. military activities in the region for Secretary of Defense Robert McNamara. On the return flight home, McNamara expresses to Ellsberg and William Macomber his view that the war in Vietnam is hopeless, yet, upon landing, McNamara expresses his confidence in the war effort. Ellsberg overhears this, and becomes disillusioned. Years later, now working for the RAND Corporation, a civilian military contractor, Ellsberg surreptitiously photocopies classified reports documenting the country's decades-long involvement in the conflict in Vietnam, dating back to the Truman administration. Ellsberg then leaks these documents to reporters at The New York Times. ", "2": "Post assistant editor Ben Bagdikian tracks down Ellsberg as the source for the leak, who provides Bagdikian with copies of the same material given to the Times. A hand-picked team of Post reporters sorts through the piles of papers, searching for the headline stories. The lawyers for the Post advise against publishing the material, lest the Nixon administration bring criminal charges against them. Graham talks to McNamara, Bradlee, and trusted Post chairman Fritz Beebe, agonizing over the decision of whether to publish. The situation is made even more complicated when the Post's lawyers discover that Bagdikian's source is the same as the Times's, possibly putting Graham in contempt of court. If charges are brought against the company, Graham could destroy the newspaper she sees as a family legacy. Alternately, if she were to win any legal challenge, the Post could instead establish itself as an important journalistic institution. She chooses to run the story. ", "3": "The White House retaliates, and in short order the Post and Times appear together before the Supreme Court to plead their First Amendment argument for the right to publish the material. Meanwhile, newspapers across the country pick up the story in solidarity with the Post and Times. The court rules 6 3 in the newspapers' favor, vindicating Graham's decision. Nixon demands that the Post should be barred from the White House. One year later, a security guard discovers a break-in in progress at the Watergate complex. "}, "7": {"0": "cast: Robert Downey Jr. as Tony Stark / Iron Man Chris Evans as Steve Rogers / Captain America Mark Ruffalo as Bruce Banner / Hulk Chris Hemsworth as Thor, the crown prince of Asgard.  Scarlett Johansson as Natasha Romanoff / Black Widow Jeremy Renner as Clint Barton / Hawkeye. critical_response: Whedon and his cohorts have managed to stir all the personalities and ingredients together so that the resulting dish, however familiar, is irresistibly tasty again.  Like a superior, state-of-the-art model built from reconstituted parts, Joss Whedon's buoyant, witty and robustly entertaining superhero smash-up is escapism of a sophisticated order, boasting a tonal assurance and rich reserves of humor that offset the potentially lumbering and unavoidably formulaic aspects of this 143-minute team-origin story.  Ruffalo is the revelation, turning Banner into a wry reservoir of calm ready to become a volcano His Iron Man is certainly a team player, but Mr. Downey comes to the party with two insuperable superpowers: a character of established sophistication the industrialist/inventor Tony Stark, a sharp-tongued man of the world and his own quicksilver presence that finds its finest expression in self-irony. . director: Joss Whedon. genre: Drama, Superhero. introduction: Marvel's The Avengers is a 2012 American superhero film based on the Marvel Comics superhero team of the same name, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures.1 It is the sixth film in the Marvel Cinematic Universe. The film was written and directed by Joss Whedon and features an ensemble cast that includes Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Tom Hiddleston, Clark Gregg, Cobie Smulders, Stellan Skarsga rd, and Samuel L. Jackson. In the film, Nick Fury, director of the peacekeeping organization S.H.I.E.L.D., recruits Iron Man, Captain America, the Hulk, and Thor to form a team that must stop Thor's brother Loki from subjugating Earth.. movieName: The Avengers. rating: Rotten Tomatoes: 92% and average: 8/10 Metacritic Score: 69/100 CinemaScore: A+. year: 2012.", "1": "The Asgardian Loki encounters the Other, the leader of an extraterrestrial race known as the Chitauri. In exchange for retrieving the Tesseract, a powerful energy source of unknown potential, the Other promises Loki an army with which he can subjugate Earth. Nick Fury, director of the espionage agency S.H.I.E.L.D., and his lieutenant Agent Maria Hill arrive at a remote research facility during an evacuation, where physicist Dr. Erik Selvig is leading a research team experimenting on the Tesseract. Agent Phil Coulson explains that the object has begun radiating an unusual form of energy. The Tesseract suddenly activates and opens a wormhole, allowing Loki to reach Earth. Loki takes the Tesseract and uses his scepter to enslave Selvig and a couple of other agents, including Clint Barton, to aid him in his getaway. ", "2": "The Avengers become divided, both over how to approach Loki and the revelation that S.H.I.E.L.D. plans to harness the Tesseract to develop weapons as a deterrent against hostile extraterrestrials. As the group argues, Barton and Loki's other possessed agents attack the Helicarrier, disabling one of its engines in flight and causing Banner to transform into the Hulk. Stark and Rogers work to restart the damaged engine, and Thor attempts to stop the Hulk's rampage. Romanoff fights Barton, and knocks him unconscious, breaking Loki's mind control. Loki escapes after killing Coulson and ejecting Thor from the airship, while the Hulk falls to the ground after attacking a S.H.I.E.L.D. fighter jet. Fury uses Coulson's death to motivate the Avengers into working as a team. Stark and Rogers realize that for Loki, simply defeating them will not be enough; he needs to overpower them publicly to validate himself as ruler of Earth. Loki uses the Tesseract, in conjunction with a device Selvig built, to open a wormhole above Stark Tower to the Chitauri fleet in space, launching his invasion. ", "3": "Rogers, Stark, Romanoff, Barton, and Thor rally in defense of New York City, the wormhole's location. Banner arrives and transforms into the Hulk, and together the Avengers battle the Chitauri while evacuating civilians. The Hulk finds Loki and beats him into submission. Romanoff makes her way to the wormhole generator, where Selvig, freed from Loki's mind control, reveals that Loki's scepter can be used to shut down the generator. Meanwhile, Fury's superiors from the World Security Council attempt to end the invasion by launching a nuclear missile at Midtown Manhattan. Stark intercepts the missile and takes it through the wormhole toward the Chitauri fleet. The missile detonates, destroying the Chitauri mothership and disabling their forces on Earth. Stark's suit runs out of power, and he falls back through the wormhole just as Romanoff closes it. Stark goes into freefall, but the Hulk saves him from crashing into the ground. In the aftermath, Thor returns Loki and the Tesseract to Asgard, while Fury expresses confidence that the Avengers will return if and when they are needed. "}, "15": {"0": "cast: Jim Carrey as Bruce Nolan Morgan Freeman as God Jennifer Aniston as Grace Connelly Lisa Ann Walter as Debbie Connelly Philip Baker Hall as Jack Baylor. critical_response: Carrey is hilarious in the slapstick scenes, but Bruce Almighty gets bogged down in treacle In one of Jim Carrey's best films he plays Bruce Nolan, a news reporter that nurses hopes of one day becoming an anchor, but is seen as too comedic by his fellow workers. Kind of like Carrey probably nursed hopes of one day becoming a real actor.. director: Tom Shadyac. genre: Comedy. introduction: Bruce Almighty is a 2003 American high-concept comedy film directed by Tom Shadyac, written by Steve Koren, Mark O'Keefe and Steve Oedekerk and stars Jim Carrey as Bruce Nolan, a down-on-his-luck TV reporter who complains to God (Morgan Freeman) that he is not doing his job correctly, and is offered the chance to try being God himself for one week.. movieName: Bruce Almighty. rating: Rotten Tomatoes:48% and average: 5.7/10 Metacritic Score: 46/100 CinemaScore: A. year: 2003.", "1": "Bruce Nolan (Jim Carrey) is a television field reporter for Eyewitness News at WKBW-TV in Buffalo, New York, but desires to be the news anchorman. He is in a relationship with his girlfriend Grace Connelly (Jennifer Aniston), but also has a mild crush on his co-worker, Susan Ortega (Catherine Bell), who barely seems to notice him. Bruce, however, suffers from constant bad luck and reaches breaking point when he is passed over for promotion by his rival, Evan Baxter (Steve Carell), who then steals dialogue from an unaired segment by Bruce while accepting the promotion on air. ", "2": "Bruce also finds ways of using the powers to cause miraculous events to occur at otherwise mundane events that he covers, such as discovering the body of Jimmy Hoffa, earning him his job back, or causing a meteor to harmlessly land near a cook-off. Bruce then uses his powers to cause Evan to humiliate himself on air, causing Evan to be fired in favor of Bruce as the new anchor. After taking Grace to a fancy dinner and telling her about his promotion (disappointing her, as she thought he was going to propose), Bruce begins to hear voices in his head. He re-encounters God, who explains that the voices are prayers to God, and that Bruce must deal with them. Bruce creates an e-mail system to receive prayers and respond to them - but finds that the influx is far too great for him to handle, even with the use of his powers. So he sets the program to automatically answer 'Yes' to every prayer, thinking this will make everyone happy. ", "3": "God appears and tells Bruce to pray for what he truly wants; Bruce prays for Grace to find a man that would make her happy. God agrees and Bruce finds himself in the hospital, shortly after being miraculously revived by the doctors. Grace arrives and the two reconcile. After his recovery, Bruce returns to his field of reporting, but takes more pleasure, in simple stories. Bruce and Grace announce their engagement on live television. The film ends with a homeless man holding a sign with philosophical messages that Bruce previously ran into on various occasions finally revealing himself to be God. "}, "29": {"0": "cast: Tom Hanks as Woody, a pull-string cowboy doll. Tim Allen as Buzz Lightyear, a space ranger action figure and Woody's rival, who later becomes his best friend. Don Rickles as Mr. Potato Head, a cynical potato-shaped doll with put-together pieces on his body. Jim Varney as Slinky Dog, a dachshund slinky toy. Wallace Shawn as Rex, a nervous green Tyrannosaurus Rex figurine.. critical_response: ... razzle-dazzle technique and unusual look'  Starting with Tom Hanks, who brings an invaluable heft and believability to Woody, Toy Story is one of the best voiced animated features in memory, with all the actors ... making their presences strongly felt. It has the purity, the ecstatic freedom of imagination, that's the hallmark of the greatest children's films. It also has the kind of spring-loaded allusive prankishness that, at times, will tickle adults even more than it does kids.  'a work of genius. It got people to understand what toys are about. They're true to their own character. And that's just brilliant. It's got a shot that's always stuck with me, when Buzz Lightyear discovers he's a toy. He's sitting on this landing at the top of the staircase and the camera pulls back and he's this tiny little figure. He was this guy with a massive ego two seconds before... and it's stunning. I'd put that as one of my top ten films, period.. director: John Lasseter. genre: Comedy, Animation,Adventure. introduction: Toy Story is a 1995 American computer-animated buddy comedy adventure film produced by Pixar Animation Studios for Walt Disney Pictures. The directorial debut of John Lasseter, Toy Story was the first feature-length computer-animated film and the first feature film produced by Pixar. Taking place in a world where anthropomorphic toys pretend to be lifeless whenever humans are present, the film's plot focuses on the relationship between Woody, an old-fashioned pullstring cowboy doll (voiced by Tom Hanks), and Buzz Lightyear, an astronaut action figure (voiced by Tim Allen), as they evolve from rivals competing for the affections of Andy, their owner, to friends who work together to be reunited with Andy as his family prepares to move to a new home. The screenplay was written by Joss Whedon, Andrew Stanton, Joel Cohen and Alec Sokolow, based on a story by Lasseter, Pete Docter, Stanton and Joe Ranft. The film features music by Randy Newman, and was executive-produced by Steve Jobs and Edwin Catmull.. movieName: Toy Story. rating: Rotten Tomatoes: 100% and average: 9/10 Metacritic Score: 95/100 CinemaScore: A. year: 1995.", "1": "In a world where toys are living things who pretend to be lifeless when humans are present, a group of toys, owned by six-year-old Andy Davis, are caught off-guard when Andy's birthday party is moved up a week, as Andy, his mother, and infant sister Molly, are preparing to move the following week. The toys' leader and Andy's favorite toy, a pull-string cowboy doll named Sheriff Woody, organizes the other toys, including Bo Peep the shepherdess, Mr. Potato Head, Rex the Dinosaur, Hamm the Piggy Bank, and Slinky Dog, into a scouting mission. Green army men, led by Sarge, spy on the party, and report the results to the others via baby monitors. The toys are relieved when the party appears to end with none of them having been replaced, but then Andy receives a surprise gift   an electronic toy space ranger action figure named Buzz Lightyear, who thinks he is an actual space ranger. ", "2": "Buzz impresses the other toys with his various features, and Andy begins to favor him, making Woody feel left out. As Andy prepares for a family outing at Pizza Planet, his mother allows him to bring one toy. Fearing Andy will choose Buzz, Woody attempts to trap Buzz behind a desk, but ends up accidentally knocking him out a window, and the other toys rebel against Woody by accusing him of knocking Buzz out of jealousy. Before they can exact revenge, Andy takes Woody instead and leaves for Pizza Planet. When the family stops for gas, Woody finds that Buzz has hitched a ride on the car as well, and fight, only to find the family has left without them. They manage to make their way to the restaurant by stowing away on a pizza delivery truck, where Buzz, still thinking he is a real space ranger, despite Woody's attempts to convince him otherwise, gets them stuck in a crane game, where they are salvaged by Andy's mischievous neighbor, Sid Phillips. ", "3": "The duo tries to make it to the moving truck, but Sid's dog, Scud, sees them, and gives chase. Buzz gets left behind while saving Woody from Scud, and Woody tries rescuing him with Andy's RC car, but the other toys, thinking Woody eliminated RC as well, attack and toss him off the truck. Having evaded Scud, Buzz and RC retrieve Woody, and continue after the truck. Upon seeing Woody and Buzz together on RC, the other toys realize their mistake, and try to help them get back aboard, but RC's batteries become depleted, stranding them. Woody ignites the rocket on Buzz's back and manages to throw RC into the truck before they soar into the air. Buzz opens his wings to free himself from the rocket before it explodes, gliding with Woody to land safely into a box in the car, right next to Andy. On Christmas Day, at their new house, Woody and Buzz stage another reconnaissance mission to prepare for the new toy arrivals. As Woody jokingly asks what might be worse than Buzz, they discover Andy's new gift is a puppy, and the two share a worried smile "}, "12": {"0": "cast: Ryan Gosling as Noah Calhoun Rachel McAdams as Allison \"Allie\" Hamilton Joan Allen as Anne Hamilton James Marsden as Lon Hammond, Jr.. critical_response: striking in its rich, saturated effects' and 'actors are blessed by good material. Gosling and especially McAdams give all-star performances, doing just enough to hand the reins over to the pros, who take what's left of the film and finish the audience off with some touching scenes that don't leave a dry eye in the house. the scenes between the young lovers confronting adult authority have the same seething tension and lurking hysteria that the young Warren Beatty and Natalie Wood brought more than 40 years ago to their roles in Splendor in the Grass. Never mind that McAdams and Gosling don't for a minute call to mind 1940s America; they're both suitably attractive and appealing. Gosling, who delivered a searing and largely unseen screen debut performance in the 2001 drama The Believer, is particularly convincing as a young man who charms his way past a girl's strongest defenses.'  Amid the sticky-sweet swamp of Jeremy Leven's script, Rowlands and Garner emerge spotless and beatific, lending a magnanimous credibility to their scenes together. These two old pros slice cleanly through the thicket of sap-weeping dialogue and contrivance, locating the terror and desolation wrought by the cruel betrayals of a failing mind. Audiences craving big, gooey over-the-top romance have their must-see summer movie in The Notebook. already one of the most intriguing young thesps, Gosling extends his range to pure romance without sacrificing a bit of his naturally subversive qualities, and even seems comfortable looking beautiful in a manly American way. The head-turner is McAdams, doing such a different perf from her top bitch in Mean Girls that it's hard to tell it's the same actor. She skillfully carries much of the film's emotional weight with a free and easy manner.. director: Nick Cassavetes. genre: Drama, romantic. introduction: The Notebook is a American romantic drama film based on the 1996 novel The Notebook by Nicholas Sparks. The film stars Ryan Gosling and Rachel McAdams as a young couple who fall in love in the 1940s. Their story is narrated from the present day by an elderly man (portrayed by James Garner) telling the tale to a fellow nursing home resident (played by Gena Rowlands, who is Cassavetes's mother).. movieName: The Notebook. rating: Rotten Tomatoes: 52% and average: 5.7/10 Metacritic Score: 53/100. year: 2004.", "1": "In 1940, Seabrook Island, South Carolina, Noah Calhoun is smitten with 17 year old heiress Allison 'Allie' Hamilton after seeing her at a carnival, and they have a summer love affair. Noah takes Allie to an abandoned house that he intends to buy for them. They try to make love, but are interrupted by Noah's friend Fin with the news that Allie's parents have the police looking for her. When Allie and Noah return to her parents' mansion, Allie's mother Anne calls Noah trash and they ban her from seeing Noah. Noah walks out and Allie chases after him. The ensuing argument between the two ends in a break up and the next morning, Anne announces that the family is returning home to Charleston.  ", "2": "Noah writes to Allie every day for a year but Anne intercepts the letters and they never reach Allie. Noah enlists with Fin to fight in World War II, where Fin is killed in battle. Allie volunteers in a hospital for wounded soldiers, where she meets officer Lon Hammond Jr., a young lawyer who comes from old Southern money. The two become engaged, to the delight of Allie's parents.  When Noah returns from the war, his father has sold their home so that Noah can buy the abandoned house. While visiting Charleston, Noah witnesses Allie and Lon kissing at a restaurant; he convinces himself that if he restores the house, Allie will come back to him. Allie is startled to read in the newspaper that Noah has completed the house to the specifications she made years before. ", "3": "Allie returns to Seabrook to find Noah living in the restored house. The two renew their relationship and make love. In the morning, Anne appears on Noah's doorstep, warning Allie that Lon has followed her to Seabrook. Anne reveals that in her youth she had been in love with a lower-class young man and still thinks of him. She then gives Allie the letters that Noah wrote to her, admitting that she hid them from Allie. Allie confesses to Lon that she has been spending time with Noah, and tells him she knows she should be with him, but she remains indecisive. Ultimately, she goes back to her relationship with Noah. "}}